{
  "theMakeOut": [
    [ "You and girlname drive up to the make-out spot.  It's dark and deserted, but has a beautiful view of the stars."],
    [ "You start to drive out to the makeout spot, up a winding hilly road.",
      "girltalk Hey! Where are we going?"
    ],
    [ "You and girlname are at the make-out spot."],
    [ "girltalk I don't feel comfortable going up there with you.",
      "girltalk Please let's go somewhere else."
    ]
  ],
  "viewStars": [
    ["You hold hands and stare into the sky together."],
    ["The cold weather works some magic on girlname's bladder."],
    ["The cold weather is making you hyper-aware of your bladder."]
  ],
  "theWalk": [
    [ "You and girlname decide to take a walk. It's a warm, still night."],
    [ "You and girlname are taking a walk together."],
    [ "You slowly open the gate and peer behind."],
    [ "The yard beyond is dark, illuminated only by starlight."],
    [ "girltalk Hey! Let's check it out."],
    [ "girlgasp We've made it to the beach!",
      "There's sand beyond the gate, and you can hear the calm waves breaking on the shore."
    ]
  ],
  "walkDesc": [
    ["You walk hand in hand past dark houses.",
      "The sidewalk is a little bit cracked here.",
      "You pass a deserted bus stop.",
      "You walk past a vacant lot, overgrown with weeds.",
      "You walk past a small city park."],
    [ "You see a tall wooden fence, and a gate sitting slightly ajar."]
  ],
  "theYard": [
    [ "You and girlname quietly enter the yard. The grass is soft and slightly damp under your feet."],
    [ "You and girlname are in somebody's back yard."],
    [ "There is a hot tub here."],
    [ "girltalk Are you sure it's going to be alright? What if someone sees us?"],
    [ "girltalk But I didn't bring a bathing suit!"],
    [ "You and girlname quickly strip off your clothes in the cover of the dark yard.",
      "You slip into the warm water of the hot tub, and watch as  girlname, now completely nude, steps in to join you.",
      "She looks so sexy in the starlight, her pussy masked in darkness and her erect nipples silhouetted against the dim sky.",
      "Though it is dark, your eyes caress the shadows of her tight curves as they slowly submerge next to you."
    ],
    ["You and girlname are in the hot tub."]
  ],
  "theBeach": [
    [ "You and girlname walk out onto the sand.  It makes a soft swooshing noise as you step, like boots on dry snow."],
    [ "You and girlname are on the dark beach."],
    [ "girltalk Hey! Want to go for a swim together?",
      "girlname seems strangely insistent. You realize that neither of you has swimming gear, so this means you get to see her naked.  Or at least see as much as you can in the dark."
    ],
    [ "You peel off your clothes and take her hand, walking slowly into the warm water.",
      "It's dark, so you can't really see what she's doing.  You hear the swooshing of the water as you walk together."],
    [ "<b>YOU:</b> But your panties - they'll get wet!",
      "girltalk How do you know they're not already wet?",
      "She has a point there."
    ],
    [ "girlname is standing beside you naked in the dark."],
    [ "girlname is standing beside you in her {0} panties in the dark."],
    [ "girltalk Aren't you going to come with me?",
      "How can you resist the invitation of a sexy, naked girl to join her swimming?"
    ],
    [ "You walk hand in hand with girlname until you're waist deep in the calm water."],
    [ "girlname gasps as a wave touches her naked crotch."],
    [ "girlname gasps as a wave soaks the crotch of her {0} panties."],
    [ "She squeezes your hand and you sense a shiver running up her spine."],
    [ "You take girlname in your arms and hug her close to you, standing knee-deep in the calm water.",
      "She pulls her belly away from you and gasps, but you grab her butt and press it into your thigh."
    ],
    [ "Her quivering bare pussy lips feel so wonderful pressed into your upper leg."],
    [ "Her warm, wet panties feel wonderful pressed into your upper leg."],
    [ "<b>I've <u>really</u> got to pee!</b> she confesses, whispering in your ear."],
    [ "girlname pauses for a moment, and over the sound of the surf, you can barely hear the hiss of her urine hitting the water."],
    [ "She's right there beside you in the dark, naked and peeing into the water."],
    [ "She's right there beside you in the dark, peeing through her wet panties into the water."],
    [ "girlname pauses for a moment.",
      "You run your hand up her smooth leg under the water.",
      "The water is even warmer around her crotch.  Probing closer, you feel a jet of hot pee escaping from between her pussy lips, passing through your fingers and warming your leg.",
      "You feel it slow, spurt a couple of times, and finally come to a stop."
    ],
    [ "girltalk maybe we should go back. Could be sharks, you know!",
      "You take her hand and lead her back to the beach where you dry off as well as you can and put your clothes back on."
    ],
    [ "She hands you her wet panties.",
      "girltalk Is there someplace you can put these?"
    ]
  ]
}