{
  "theatre": [
    [ "girlname giggles: But we've already been to the theater, silly!"],
    [ "You and girlname arrive at the movie theatre"],
    [ "You are with girlname in the movie theatre."]
  ],
  "darkTheatre": [
    [ "You and girlname enter the movie theatre. It's dark, silent and deserted."],
    [ "You are with girlname in the closed movie theatre."]
  ],
  "favouriteMovie": {
    "theurge": {
      "name": "The Urge",
      "choice": "Nah. Horror flicks are boring.",
      "description": "The Urge - <i>A horror flick</i>"
    },
    "thedesp": {
      "name": "Desperate HouseWives",
      "choice": "Nah. That's a chick flick!",
      "description": "Desperate Housewives : The Movie"
    },
    "thectrl": {
      "name": "Control Yourself",
      "choice": "Nah. College films are stupid.",
      "description": "Control Yourself - <i>A romantic comedy</i>"
    },
    "thelitr": {
      "name": "2 Liters",
      "choice": "Nah. College films are stupid.",
      "description": "2 Liters, 25 Hours - <i>A police drama</i>"
    }
  },
  "watchMovie": [
    [ "girlname smiles at you.",
      "girltalk I'd love to see {0}."
    ],
    [ "girlname laughs: Two movies in one night? Let's go do something else!"]
  ],
  "stealSoda": [
    ["You climb behind the snack counter, grab a big paper cup.  You scoop a bit of ice and fill it to the top, capping it with a lid and a straw."],
    ["You grab another paper cup, and fill it up in a similar way as the previous one."]
  ],
  "noRest": [
    [ "<b>You:</b> Why don't you go ahead and go.  But not in the restrooms."],
    [ "girltalk What? Then where am I supposed to go?"],
    [ "girltalk No way, dude. I'm outta here."],
    [ "girlname sighs in relief, and seems very aroused.",
      "girltalk I feel <i>so</i> naughty!"
    ]
  ],
  "noToilet": {
    "trash": {
      "text": "Tell her to pee in the trash can.",
      "quotes": [
        [ "<b>You:</b> How about that trashcan?"],
        [ "girlname looks around apprehensively before heading over to it.",
          "girltalk Am I gonna regret this?"
        ],
        [ "Quickly girlname lowers herself over the trashcan and lets go. Her pee hisses out and hits the trashcan liner with a loud clatter.",
          "The bottom of the trashcan is a sea of fragrant pee.  You offer her a tissue, but she simply gets back up and gives you a hug.",
          "girltalk That's <u>so</u> much better."
        ]
      ]
    },
    "sink": {
      "text": "Tell her to pee in the snack counter sink.",
      "quotes": [
        [ "<b>You:</b> How about the sink over there?"],
        [ "girlname looks around apprehensively before climbing over the snack counter.",
          "girltalk How am I gonna do this?"],
        [ "Carefully, girlname lifts herself up onto the counter and positions her butt over the sink. Even before she's settled into place, she lets go.  Her pee hisses out and hits the metal sink with a loud clatter."]
      ]
    },
    "soda": {
      "text": "Tell her to pee in a soda cup.",
      "quotes": [
        [ "<b>You:</b> How about a soda cup?"],
        [ "girlname looks around apprehensively as you get a big plastic soda cup from behind the snack counter.",
          "girltalk Am I gonna regret this?"
        ],
        [ "Carefully girlname brings the cup between her beautiful trembling thighs and lets go. Her pee hisses out and foams into the cup.",
          "girltalk That's better!",
          "She puts a lid on the cup and hands it to you.  The cup is warm with the heat of her urine, and her scent wafts from the straw hole."
        ]
      ]
    },
    "floor": {
      "text": "Tell her to go on the floor.",
      "quotes": [
        [ "<b>YOU:</b> Why don't you pee right there on the carpet?"],
        [ "girlname looks around apprehensively before squatting down.",
          "girltalk Are you sure we're not gonna get in trouble?"
        ],
        [ "girlname starts to pee immediately.  Her stream hisses out and spatters on the carpet, which soaks it up quickly, making a gurgling spattering noise.  The scent of her pee fills the air."]
      ]
    }
  }
}