{
  "theatre": [
    [ "girlname giggles: But we've already been to the theater, silly!"],
    [ "You and girlname arrive at the movie theatre"],
    [ "You are with girlname in the movie theatre."]
  ],
  "darkTheatre": [
    [ "You and girlname enter the movie theatre. It's dark, silent and deserted."],
    [ "You are with girlname in the closed movie theatre."]
  ],
  "favouriteMovie": {
    "theurge": {
      "name": "The Urge",
      "choice": "Nah. Horror flicks are boring.",
      "description": "The Urge - <i>A horror flick</i>",
      "plot": [
        "The movie has just started.",
        "On the big screen, the heroine is being introduced - she apparently has some kind of super powers which are only activated by an intense need to pee.",
        "The movie has gotten to a scary part where the heroine is being stalked, but her bladder is far from full.",
        "The movie has reached a point where the heroine, after finally filling her bladder and dispensing with her attackers, is making out with her lover.",
        "The movie has reached a romantic interlude where the heroine decides to rescue her lover ... though she apparently has to pee bad since she never went to the restroom!",
        "In the movie, the lover has been rescued, and they are making out again.  The heroine is heroically resisting her incredible urge to pee.",
        "The movie is reaching a conclusion and the heroine is running hand in hand with her lover towards the bathroom as the credits roll."]
    },
    "thedesp": {
      "name": "Desperate HouseWives",
      "choice": "Nah. That's a chick flick!",
      "description": "Desperate Housewives : The Movie",
      "plot": [
        "The movie is starting.",
        "On the screen, the main characters are being introduced - three young newlyweds - a blonde, brunette and redhead - with controlling husbands who tell them they're not allowed to pee while the husband is away at work.",
        "In the movie, the redhead is waiting at home in the late afternoon, desperate to pee.  Tension rapidly builds as her husband is stuck in traffic on the way home.  She's on the verge of losing control.",
        "On screen, the redhead's husband finally shows up and she is overjoyed to see him.  They end up passionately making out at the front door.",
        "In the movie, the redhead is lovingly undressed and sat on the toilet by her husband, after which they share the romantic dinner she prepared while she was waiting for him to come home." ,
        "In the movie, the blonde and brunette both meet up unexpectedly while out walking their dogs and trying to get their minds off their bursting bladders.  They make small talk, and because their minds are otherwise occupied, they don't seem to be able to tear themselves away from the conversation.  Eventually, the secret comes out, and they are turned on so much they engage in some heavy petting on the excuse of helping to hold it in.",
        "In the movie, the two entangled and desperate women are found by their returning husbands, who rather than being angry, declare their gratitude for such devotion in the face of extreme bladder pressure.  The foursome goes out for a romantic candle-lit dinner after a discrete stop behind the bushes."]
    },
    "thectrl": {
      "name": "Control Yourself",
      "choice": "Nah. College films are stupid.",
      "description": "Control Yourself - <i>A romantic comedy</i>",
      "plot": [
        "The previews have just finished and the movie comes on.",
        "The movie's main character is introduced, a young and outgoing college girl whose one failing is her shyness when it comes to telling other people she needs to pee.",
        "Ominous music plays and tension rises as the film follows the slender youth into a 7-11 where she buys a huge soda <i>right before her two hour final exams</i>.",
        "On the big screen, the girl quickly downs the soda on the way to her test when she meets up with her boyfriend.  They adjourn behind a tree for a quickie and the camera is not afraid to follow them as they run their hands underneath each others clothes and build up a little sweat.",
        "The movie has reached a point where the girl must leave for her test, and her boyfriend comforts her fears of failure, promising to marry her if she passes.",
        "On the screen, after a very interesting stop motion sequence showing the test and the girl's increasingly desperate need to pee, the test is finally over and she speeds out of the room - of course running into her boyfriend again, who mistakes her desperate struggles for another type of desire.  They find a private restroom this time and clumsily rip each others clothes off.  The girl looks longingly at the toilet but says nothing." ,
        "As the credits roll, the girl finally works up the courage to admit she has to pee like hell, and they kiss passionately as she finally is able to sit on the toilet and empty her bladder."]
    },
    "thelitr": {
      "name": "2 Liters",
      "choice": "Nah. College films are stupid.",
      "description": "2 Liters, 25 Hours - <i>A police drama</i>",
      "plot": [
        "You settle into your cushy seat with her by your side and the lights dim.",
        "The main detective is being introduced to dramatic music.  She's a young chinese woman with mad kung-fu skills, out to prove herself in the police force.  At the beginning of the movie, she's in kung-fu focus training, which somehow involves trying to ignore a very full bladder while practicing forms.",
        "On the big screen, our heroine is staking out a gangster.  More specifically, she's gotten herself stuck in a closet in his bedroom and he seems to have come home with company.",
        "In the movie, the head gangster has entered the bedroom and he's making out with a bevy of gangsterettes while our heroine watches from the closet.  She is getting turned on big time watching it all and she's got to pee in a bad way ... her hand strays to caress her pussy under her short skirt.",
        "After a harrowing escape, our heroine comes home and is greeted by her dog, to whom she confesses her doubts and fears while seated on the toilet.  The dog is suitably sympathetic and lays its head in her lap.",
        "The movie continues into a strange sex scene where the heroine is making out with the gangster boss and keeps excusing herself to go pee.  Not only is he reluctant to let her go pee, but when she is finally allowed to pee, she immediately feels an even stronger urge to go again when she returns.  Still, they work their way up to a sweaty climax - her acting is excellent, or maybe not even acting - the bulge of her bladder is clearly visible on screen." ,
        "In the movie the heroine finally wakes up - it was all a dream.  She's in bed with her husband who hugs her tight and says she's been sleeping for nearly 25 hours.  He says he can't believe she didn't even get up to pee, and offers her a mason jar, which she fills, blissfully held in his arms."]
    }
  },
  "watchMovie": [
    [ "girlname smiles at you.",
      "girltalk I'd love to see {0}."
    ],
    [ "girlname laughs: Two movies in one night? Let's go do something else!"],
    [ "the other movies that are playing:"],
    [ "there are many movies playing."],
    [ "She looks like she wants to argue, but doesn't."],
    [ "girlname looks you directly in the eyes and a pout forms on her lips.",
      "girltalk But I wanna watch {0}!"
    ],
    ["You and girlname enter the darkened theatre."],
    ["You are watching the movie."],
    ["The movie has ended."],
    ["girlname is sitting beside you."]
  ],
  "movieRomance": [
    ["You reach over and hold your hand in hers."],
    ["She gives your hand a squeeze."],
    "Her hand is kind of cold."
  ],
  "stealSoda": [
    ["You climb behind the snack counter, grab a big paper cup.  You scoop a bit of ice and fill it to the top, capping it with a lid and a straw."],
    ["You grab another paper cup, and fill it up in a similar way as the previous one."]
  ],
  "noRest": [
    [ "<b>You:</b> Why don't you go ahead and go.  But not in the restrooms."],
    [ "girltalk What? Then where am I supposed to go?"],
    [ "girltalk No way, dude. I'm outta here."],
    [ "girlname sighs in relief, and seems very aroused.",
      "girltalk I feel <i>so</i> naughty!"
    ]
  ],
  "noToilet": {
    "trash": {
      "text": "Tell her to pee in the trash can.",
      "quotes": [
        [ "<b>You:</b> How about that trashcan?"],
        [ "girlname looks around apprehensively before heading over to it.",
          "girltalk Am I gonna regret this?"
        ],
        [ "Quickly girlname lowers herself over the trashcan and lets go. Her pee hisses out and hits the trashcan liner with a loud clatter.",
          "The bottom of the trashcan is a sea of fragrant pee.  You offer her a tissue, but she simply gets back up and gives you a hug.",
          "girltalk That's <u>so</u> much better."
        ]
      ]
    },
    "sink": {
      "text": "Tell her to pee in the snack counter sink.",
      "quotes": [
        [ "<b>You:</b> How about the sink over there?"],
        [ "girlname looks around apprehensively before climbing over the snack counter.",
          "girltalk How am I gonna do this?"],
        [ "Carefully, girlname lifts herself up onto the counter and positions her butt over the sink. Even before she's settled into place, she lets go.  Her pee hisses out and hits the metal sink with a loud clatter."]
      ]
    },
    "soda": {
      "text": "Tell her to pee in a soda cup.",
      "quotes": [
        [ "<b>You:</b> How about a soda cup?"],
        [ "girlname looks around apprehensively as you get a big plastic soda cup from behind the snack counter.",
          "girltalk Am I gonna regret this?"
        ],
        [ "Carefully girlname brings the cup between her beautiful trembling thighs and lets go. Her pee hisses out and foams into the cup.",
          "girltalk That's better!",
          "She puts a lid on the cup and hands it to you.  The cup is warm with the heat of her urine, and her scent wafts from the straw hole."
        ]
      ]
    },
    "floor": {
      "text": "Tell her to go on the floor.",
      "quotes": [
        [ "<b>YOU:</b> Why don't you pee right there on the carpet?"],
        [ "girlname looks around apprehensively before squatting down.",
          "girltalk Are you sure we're not gonna get in trouble?"
        ],
        [ "girlname starts to pee immediately.  Her stream hisses out and spatters on the carpet, which soaks it up quickly, making a gurgling spattering noise.  The scent of her pee fills the air."]
      ]
    }
  },
  "buySoda": [
    "<form name=buySoda>",
    "<p> You buy ",
    "<input class=buy type=number name=sodaAm id=sodaAm value=1 min=1 max=100> soda(s)</p>",
    "</p>For $ <text id=monAmount>5</text></p>",
    "<p><li class='cListener' id=buy>Continue...</li></p>"
  ],
  "buySoda2": [
    ["You don't have enough money."],
    ["Uhm, you can't buy negative drinks."],
    ["Whoa, give the poor employee a break, there is no way you need more than a 100 drinks..."],
    ["You pay for them before going back to girlname."]
  ]
}