{
  "theBar": [
    ["girlname giggles: \"But we've already been to the bar, silly!\""],
    ["You and girlname enter the Bar, taking a couple of stools about halfway down."],
    ["You are with girlname in the Bar."]
  ],
  "barTalk": [
    [
      "I'll tell you about my family.  Mostly, there's just me and my brother.  My parents are miraculously still together, and still in the same house they bought back in the 60's...",
      "You say you wish you had a brother.",
      "You say your parents are still together too.",
      "You say you wish you had a sister growing up."
    ],
    [
      "Man, my work has been keeping me <u>so</u> busy.",
      "You ask her more about her job.",
      "You say her job sounds like a difficult one.",
      "You talk about your job and how you're up for a promotion."
    ],
    [
      "You know, I haven't been dating for quite a while.",
      "You ask her why a pretty girl like her hasn't been out dating.",
      "You say you're honored to be the one to break the losing streak.",
      "You say you've been dating a lot recently."
    ],
    [
      "The weather has been really nice this week.",
      "You agree and ask her if she's been out doing anything since the weather's been so nice.",
      "You agree and tell her you've been out enjoying it.",
      "You say you hadn't noticed the weather because you've been at work."
    ],
    [
      "Do you have any pets?",
      "You say you had a dog as a kid ... and would like to get another someday.",
      "You say you've never had a pet.",
      "You say you want to get a cat someday."
    ],
    [
      "I <u>love</u> playing the piano. Do you play any instruments?",
      "Yeah! I also play the piano. I learned it as a kid.",
      "I've been wanting to learn guitar, but never gotten round to it.",
      "Nah, I'm not really a music fan."
    ],
    [ "Do you play any sports",
      "I love playing tennis, what about you?",
      "I go to the gym every now and then.",
      "No, I don't really like to sport."]
  ],
  "barResp": [
    [
      "girlname looks you in the eyes and smiles as she talks.",
      "girlname leans towards you and smile.",
      "girlname seems pleased with the conversation.",
      "you feel girlname's foot playfully brush your leg, and she smiles as she talks.",
      "girlname touches your shoulder gently.",
      "girlname seems to be playing with the top button of her blouse as she talks."
    ],
    [
      "girlname seems uninterested in the conversation.",
      "girlname twirls her hair around her finger as she talks.",
      "girlname leans back in her chair.",
      "girlname glances around the room.",
      "girlname fiddles with her napkin.",
      "girlname glances quickly at her watch"
    ],
    [
      "girlname leans back in her chair and sighs.",
      "girlname frowns.",
      "girlname looks pointedly at her watch.",
      "girlname seems more interested in shredding her napkin into little strips that what you have to say.",
      "girlname appears engrossed in the program on the bar television ... which is an infomercial for Arizona real estate.",
      "girlname looks exasperated."
    ]
  ],
  "barQuotes": [
    "<b>Bartender:</b> Nice girl you've got there. Bet she'll pee herself if she holds a drop over bladlose ml, though.",
    "<b>Bartender:</b> She's cute, isn't she?  I bet if you found her a cocktail, she'd be a lot less inhibited about drinking.",
    "<b>Bartender:</b> Did you know that beer is a diuretic?",
    "<b>Bartender:</b> Say, you don't happen to know where a man could buy a set of wet panties around here, do you?",
    "<b>Bartender:</b> How about them Dodgers?",
    "<b>Bartender:</b> I've been thinking about starting a bladder buster night here on Mondays."
  ],
  "darkBar":[
    ["girlname rushes to the toilets through the dark, and deserted bar while you slowly close the door behind you."],
    ["You and girlname enter the bar, she's making no effort to hide how badly she has to pee and you are loving it."],
    ["You and girlname enter the Bar. It's dark, silent and deserted."],
    ["You are with girlname in the closed Bar."]
  ],
  "drinkingGame": [
    [ "<b>You: </b> Why don't you go ahead and go. But afterwards let's play a little drinking game.",
      "girltalk What <u>kind</u> of drinking game?",
      "<b>You: </b> We'll pace each other drinking beers. First one to pee is the loser."
    ],
    [ "girltalk Okay. But let's go pee first."],
    [ "girltalk No way, dude. I'm outta here."],
    [ "You both head off to the restrooms to empty your bladders.",
      "Standing in front of the urinal, you imagine her sitting and peeing on the other side of the wall as you drain your bladder of every last drop.",
      "You hear the muffled flush of a toilet from the ladies room and walk back out to meet her coming out of the restroom.",
      "She seems really relieved, and a bit aroused."
    ],
    [ "<b>You: </b> Okay.  All better now?",
      "<b>You:</b> Here's the rules: we both drink shots of beer until one of us can't hold it.  There's no holding, no tickling, and you have to drain the glass in one go.  Any questions?",
      "girltalk Okay but you're going <i>DOWN</i>!"
    ],
    [ "You're playing a drinking game with girlname."],
    [ "<b>You:</b> It's time to drink up!",
      "You pull two beers, toast, and both drain the glasses."
    ]
  ],
  "postGameHer": [
    [ "<b>You</b> You lost it, didn't you? You spurted!",
      "<b>You:</b>What were we playing for again?"
    ],
    [ "<b>YOU:</b> Ha!  You lose!  What were we playing for again?"],
    [ "<b>girlname laughs:</b> We didn't really think of that, did we? How about a kiss?"],
    [ "You wince slightly at your throbbing bladder.",
      "\"I gotta pee <b>first<b>.\"",
      "Both of you say simultaneously",
      "You both head off to the restrooms to relieve and clean up."
    ],
    [ "You reach out to take her in your arms... hoping to squeeze her really tight.",
      "girltalk But I gotta pee <b>FIRST</b>.",
      "She heads towards the bathroom, you stay behind waiting for her to come back."
    ],
    [ "She reaches towards you, and you want to stay, but you simply have to head off to the restrooms to relieve yourself."],
    [ "She reaches towards you and you pull her on your lap, kissing her soundly while cupping a feel."]
  ],
  "postGameYou": [
    [ "girltalk You lost it, didn't you? You spurted!",
      "girltalk What were we playing for again?"
    ],
    [ "girltalk Ha! I told you'd I'd win. Now what though?" ],
    [ "<b>You: </b> Yeah, we didn't really think that through, did we?",
      "<b>You: </b> How about a kiss.",
      "girlname nods her head in agreement."
    ],
    [ "\"I have to pee first though\"",
      "You say at the same time.",
      "Both of you move to the restrooms to take care of buisness."
    ],
    [ "You reach out to take her in your arms... hoping to squeeze her really tight.",
      "girltalk But I gotta pee <b>FIRST</b>.",
      "She heads towards the bathroom, you stay behind waiting for her to come back."
    ],
    [ "She reaches towards you, and you want to stay, but you simply have to head off to the restrooms to relieve yourself."],
    [ "She reaches towards you and you pull her on your lap, kissing her soundly while cupping a feel."]
  ]
}