{
  "theClub": [
    [ "girlname giggles: But we've already been to the club, silly!"],
    [ "You and girlname enter the Night Club."],
    [ "You are with girlname in the Night Club."],
    [ "girltalk Okay.  Let's dance.",
      "You head out to the dancefloor to cut up the rug."
    ]
  ],
  "Dancing": "Your are dancing with girlname in your arms",
  "leaveDance": "You pull girlname off the dancefloor.",
  "darkClubEnter": "You and girlname enter the nightclub. It's dark and deserted.",
  "darkClubBe": "You are with girlname in the closed nightclub.",
  "emerBreak": ["girlname practically runs to the toilets through the dark room. Leaving you alone in the doorway."
  , "As you imagine her rushing into a stall, desperately squirming, you close the door behind you."
  ],
  "emerHold": "You and girlname enter the club. She's openly squirming and you can't help but stare.",
  "photoGameConvince": "<b>You: </b> I know you really need to go, but can I take just a couple of snapshots first?",
  "questPic": "girltalk What <u>kind</u> of pictures?",
  "choices": {
    "snapshots": "Just a couple snapshots of you on the stage there.",
    "costume": "How about a few costume pics?",
    "nudes": "Well - nobody's around, so I'd really love it if you would do a few nudes.",
    "startGame": "I'd really like it if you'd wait...",
    "indepee": "Alright - go ahead and pee first.",
    "photoPose": "Ask her to pose.",
    "photoChange": "Ask her to change.",
    "photoNude": "Ask her to disrobe.",
    "goback": "Photo session is over...",
    "takePhoto": "Take a photo..."
  },
  "gameFail": "girltalk No way, dude. I'm outta here.",
  "gameAccept": {
    "snapshots":  "girltalk I'd really like it if you'd wait...",
    "costume": "girltalk Okay.  But can I please go pee first?",
    "nudes": "girltalk That's naughty.  Very naughty.  But can I please go pee first?"
  },
  "photoGameStart": [
    "<b> You: </b> Thanks. You're very sexy.",
    "You motion girlname up onto the nightclub stage.",
    "She carefully ascends the stairs, and you find a switch that turns on some stage lights."
  ],
  "midPhotoGame":{
    "common": "You're taking snapshots of girlname up on the nightclub stage.",
    "nude": "She's completely nude.",
    "costume": "She's wearing {0}."
  },
  "askPose": "<b> You: </b> How about striking a pose?",
  "poseNude": [
    "girlname shyly covers her breasts with one hand and her pussy with the other.  Her face is a bright red.",
    "girlname turns her back to you and tries to hide her bare bottom with one hand while she looks back over her shoulder.  You see the curls of her pubic hair in the space between her legs.",
    "girlname slowly turns toward you, her breasts pressed between her extended arms, and both hands firmly blocking your view of her crotch.",
    "girlname shyly moves one of her hands to her hip and cups a breast with the other.  She holds one leg crossed just a little forward, squeezing the exposed slit of her pussy closed.",
    "girlname turns slightly, spreads her legs and caresses her inner thigh with one hand while spreading the other across the opposite butt cheek.",
    "girlname turns away and bends down to touch her toes, legs spread slightly.  Her glistening pussy and cute, tight anus are fully exposed to your camera."
  ],
  "poseEmer": [
    "<i>She seems to be having trouble keeping her legs still for any length of time, and she's breathing hard with the effort to control her bladder.</i>",
    "<i>She keeps unconsciously moving her hand closer to her pussy from behind and then catching herself and moving it back.  Her expression is strained as she tries to hold her pee and hold still at the same time.</i>",
    "<i>You can see sweat on her face as she tries to fight the burning pressure in her bladder and stay posed until you take a picture.</i>",
    "<i>She's trembling with the effort to control her bladder using just her sphincters while holding the pose at the same time.</i>",
    "<i>Her hips won't stop moving as she tries to manage her overwhelming urge to pee without breaking the pose.</i>",
    "<i>She's gasping for breath as she fights the spasms and her whole body shakes with the effort to hold both the pose and the contents of her overfull bladder.</i>"
  ],
  "photoChange": {
    "common": "<b>You: </b> How about changing into a costume?",
    "emer": "girlname is almost doubled over as she takes little baby steps back to the closet and returns with a {0}.",
    "normal": "girlname walks back to the closet and returns with a {0}."
  },
  "photoNude": {
    "common": "<b>You: </b> Okay - so you can take off your clothes.",
    "emerStart": [
      "<i>You can see her face filled with a look of concentration as she waits for an opportune moment to continue.</i>",
      "She then shyly unclasps her bra, revealing her breasts briefly before turning her back to you.  Her thighs are rubbing together."
    ],
    "emerNoPanty": "She quickly crosses her legs and squeezes tightly - she was not wearing any panties.",
    "emerPanty": "She hesitates and looks to you for confirmation before spreading her legs slightly, giving her pussy a firm press, and quickly slipping her panties off then tightly crossing her legs.",
    "normNoPanty": "She's not wearing any panties.",
    "normPanty": "She hesitates and looks to you for confirmation before slipping her panties off and placing them on the floor next to her.",
    "stage": "She's standing on stage completely nude."
  },
  "barGirlDesc": [
    "The girl tending the bar is really good-looking.",
    "You can't help but notice how good the bartender looks in her uniform.",
    "The bar girl seems to be smiling at you, and she looks pretty hot.",
    "The gorgeous bartender keeps stealing glances at you - you wonder if she's trying to tell you something.",
    "The bar girl leans over the bar giving you an eyeful down her shirt.",
    "The bar girl bites her lip as she locks eyes with you."],
  "barGirlQuotes": [
    "<b>BarGirl:</b> It's pretty crowded tonight, isn't it?",
    "<b>BarGirl:</b> Do you come here often?",
    "<b>BarGirl:</b> Wow!  Have you seen the line for the restrooms tonight?",
    "<b>BarGirl:</b> Anything else I can do for you?",
    "<b>BarGirl:</b> Man it's hot in here, isn't it?",
    "<b>BarGirl:</b> Hey, handsome, did you come here alone?"],
  "barGirlFlirt": [
    "<b>YOU:</b> Wow, that outfit looks so good on you! Where'd you get it?",
    "<b>YOU:</b> Hey!  Haven't I seen you before somewhere?  Nope - I'd definitely remember that well.",
    "<b>YOU:</b> What a busy night!  When do you get off?",
    "<b>YOU:</b> I'm sorry to stare - it's just that you're the most stunningly beautiful woman I've seen tonight.",
    "<b>YOU:</b> Have you been working here long?  I think I'd remember a beautiful face like yours.",
    "<b>YOU:</b> Damn, you're good looking."],
  "barGirlResp": [
    "<b>BarGirl:</b> Thanks!  I made it ... do you think it's too sexy?",
    "<b>BarGirl:</b> I don't think we've met - my name's Cynthia.",
    "<b>BarGirl:</b> I'm working here until closing, but I might get off sooner with a little help.",
    "<b>BarGirl:</b> Gee - thanks!  Do you really mean it?  Look all you want!",
    "<b>BarGirl:</b> Well I just started last week ... am I doing okay?",
    "<b>BarGirl:</b> Well, you're not too bad looking yourself."]
}