{
  "girls": {
    "Laura": {
      "stareather": {
        "jeans": [
          "You find yourself distracted by her plump but tight ass, and thoughts of x-ray vision fill your head until you pull yourself back to reality.",
          "You notice her perky breasts and imagine yourself pulling her tight t-shirt aside and cupping them as they harden to your touch, but you catch yourself staring and look away.",
          "You stare at her lap, imagining beautiful brown curls hiding a soft and wet cunt sitting in the gap between her smooth, tanned thighs.  You quickly wipe the stupid grin off your face and pay attention.",
          "You concentrate on her firm thighs, tightly outlined in her painted-on jeans, and imagine running your hand up between her long legs and feeling the warm wetness.  You feel dizzy and snap back to reality.",
          "You stare at her perfect white teeth behind full lips and briefly imagine them wrapped around your dick before trying to re-mesh with reality.",
          "You look longingly at her tight jeans, imagining your hands grasping her waist, pulling at the zipper and peeling it off her to reveal what's underneath, but catch yourself staring too long and force yourself to reconnect with the real world.  You quickly suppress the thought and try to pay attention."],
        "skirt": [
          "You find yourself distracted by her plump but tight ass, and thoughts of x-ray vision fill your head until you pull yourself back to reality.",
          "You notice her perky breasts and imagine yourself pulling her blouse open and cupping them as they harden to your touch, but you catch yourself staring and look away.",
          "You stare at her lap, imagining beautiful brown curls hiding a soft and wet cunt sitting in the gap between her smooth, tanned thighs.  You quickly wipe the stupid grin off your face and pay attention.",
          "You concentrate on her firm thighs as they disappear up under her skirt, and imagine running your hand up between her long legs and feeling the warm wetness.  You feel dizzy and snap back to reality.",
          "You stare at her perfect white teeth behind full lips and briefly imagine them wrapped around your dick before trying to re-mesh with reality.",
          "You look longingly at her short skirt, imagining your hands grasping her waist, pulling at the zipper and peeling it off her to reveal what's underneath, but catch yourself staring too long and force yourself to reconnect with the real world.  You quickly suppress the thought and try to pay attention."]
      }
    },
    "Karen": {
      "stareather": {
        "jeans": [
          "You find yourself distracted by her tiny ass, and thoughts of x-ray vision fill your head until you pull yourself back to reality.",
          "You notice her small perky breasts and imagine yourself pulling her tight t-shirt aside and cupping them as they harden to your touch, but you catch yourself staring and look away.",
          "You stare at her lap, imagining beautiful dark curls hiding a soft and wet cunt sitting in the gap between her trim thighs.  You quickly wipe the stupid grin off your face and pay attention.",
          "You concentrate on her firm thighs outlined in her painted-on jeans, and imagine running your hand up between her smooth little legs and feeling the warm wetness.  You feel dizzy and snap back to reality.",
          "You stare at her perfect white teeth behind thin red lips and briefly imagine them wrapped around your dick before trying to re-mesh with reality.",
          "You look longingly at her tight jeans, imagining your hands grasping her waist, pulling at the zipper and peeling it off her, then running down and cupping her beautiful ass, but catch yourself staring too long and force yourself to reconnect with the real world.  You quickly suppress the thought and try to pay attention."],
        "skirt": [
          "You find yourself distracted by her tiny ass, and thoughts of x-ray vision fill your head until you pull yourself back to reality.",
          "You notice her small perky breasts and imagine yourself pulling her blouse open and cupping them as they harden to your touch, but you catch yourself staring and look away.",
          "You stare at her lap, imagining beautiful dark curls hiding a soft and wet cunt sitting in the gap between her trim thighs.  You quickly wipe the stupid grin off your face and pay attention.",
          "You concentrate on her firm thighs as they disappear up under her skirt, and imagine running your hand up between her smooth little legs and feeling the warm wetness.  You feel dizzy and snap back to reality.",
          "You stare at her perfect white teeth behind thin red lips and briefly imagine them wrapped around your dick before trying to re-mesh with reality.",
          "You look longingly at her short skirt, imagining your hands grasping her waist, pulling at the zipper and peeling it off her, then running down and cupping her beautiful ass, but catch yourself staring too long and force yourself to reconnect with the real world.  You quickly suppress the thought and try to pay attention."]
      }
    },
    "Jennifer": {
        "stareather": {
          "jeans": [
            "You find yourself distracted by her full, supple ass, and thoughts of x-ray vision fill your head until you pull yourself back to reality.",
            "You notice her voluptuous breasts and imagine yourself pulling her tight t-shirt aside just a little and cupping them as they overflow into your waiting hands, but you catch yourself staring and look away.",
            "You stare at her lap, imagining beautiful blond curls hiding a soft and wet cunt sitting at the top of her smooth, firm thighs.  You quickly wipe the stupid grin off your face and pay attention.",
            "You concentrate on her long legs wrapped tightly in her painted-on jeans, and imagine running your hand up between her smooth tanned thighs and feeling the warm wetness.  You feel dizzy and snap back to reality.",
            "You stare at her perfect white teeth behind ruby red lips and briefly imagine them wrapped around your dick before trying to re-mesh with reality.",
            "You look longingly at her tight jeans, imagining your hands grasping her waist, pulling at the zipper and peeling it off her to reveal what's underneath, but catch yourself staring too long and force yourself to reconnect with the real world.  You quickly suppress the thought and try to pay attention."],
          "skirt":[
            "You find yourself distracted by her full, supple ass, and thoughts of x-ray vision fill your head until you pull yourself back to reality.",
            "You notice her voluptuous breasts and imagine yourself pulling her blouse down just a little and cupping them as they overflow into your waiting hands, but you catch yourself staring and look away.",
            "You stare at her lap, imagining beautiful blond curls hiding a soft and wet cunt sitting at the top of her smooth, firm thighs.  You quickly wipe the stupid grin off your face and pay attention.",
            "You concentrate on her long legs as they disappear up under her skirt, and imagine running your hand up between her smooth tanned thighs and feeling the warm wetness.  You feel dizzy and snap back to reality.",
            "You stare at her perfect white teeth behind ruby red lips and briefly imagine them wrapped around your dick before trying to re-mesh with reality.",
            "You look longingly at her short skirt, imagining your hands grasping her waist, pulling at the zipper and peeling it off her to reveal what's underneath, but catch yourself staring too long and force yourself to reconnect with the real world.  You quickly suppress the thought and try to pay attention."]
        }
    },
    "Melissa":{
      "stareather": {
        "jeans": [
          "You find yourself distracted by her trim ass, and thoughts of x-ray vision fill your head until you pull yourself back to reality.",
          "You notice her full breasts and imagine yourself pulling her t-shirt aside just a little until they spill out into your hands, but you catch yourself staring and look away.",
          "You stare at her lap, imagining beautiful red curls hiding a soft and wet cunt sitting at the top of her smooth, firm thighs.  You quickly wipe the stupid grin off your face and pay attention.",
          "You concentrate on her long legs tightly wrapped in her painted-on jeans, and imagine running your hand up between her smooth tanned thighs and feeling the warm wetness.  You feel dizzy and snap back to reality.",
          "You stare at her perfect white teeth behind full lips and briefly imagine them wrapped around your dick before trying to re-mesh with reality.",
          "You look longingly at her tight jeans, imagining your hands grasping her waist, pulling at the zipper and peeling it off her while running across her marvelous behind, but catch yourself staring too long and force yourself to reconnect with the real world.  You quickly suppress the thought and try to pay attention."],
        "skirt": [
          "You find yourself distracted by her trim ass, and thoughts of x-ray vision fill your head until you pull yourself back to reality.",
          "You notice her full breasts and imagine yourself pulling her blouse down just a little until they spill out into your hands, but you catch yourself staring and look away.",
          "You stare at her lap, imagining beautiful red curls hiding a soft and wet cunt sitting at the top of her smooth, firm thighs.  You quickly wipe the stupid grin off your face and pay attention.",
          "You concentrate on her long legs as they disappear up under her skirt, and imagine running your hand up between her smooth tanned thighs and feeling the warm wetness.  You feel dizzy and snap back to reality.",
          "You stare at her perfect white teeth behind full lips and briefly imagine them wrapped around your dick before trying to re-mesh with reality.",
          "You look longingly at her short skirt, imagining your hands grasping her waist, pulling at the zipper and peeling it off her while running across her marvelous behind, but catch yourself staring too long and force yourself to reconnect with the real world.  You quickly suppress the thought and try to pay attention."]
      }
    }

  },
  "clothes":
  {
    "jeans": {
      "thighresp": [
        "She spreads her legs slightly, inviting your hand a bit higher.",
        "She places her hand on yours and moves it a little further between her legs.",
        "She shifts in her chair, pressing your hand between the her legs.",
        "Her breathing becomes audible and you feel the heat of her body through her thin jeans.",
        "She moves in her chair and your hand is suddenly between her thighs.",
        "She lets out a barely audible sigh and you feel gooseflesh form under your fingers."
      ],
      "feelher": [
        "You put your hand on her butt.",
        "You reach around and put your hand on her breast.",
        "You put your hand on her thigh",
        "You reach around and put your hand on her belly.",
        "You press your body against her pubes.",
        "You slide your hand down under the waistband of her tight jeans."
      ],
      "feelres": [
        "It's tight and smooth beneath the thin fabric of her tight jeans.",
        "It's warm and soft.  You feel the erect nipple through her thin t-shirt, and give it a tweak as your hand passes over.",
        "The skin is smooth and supple ... and just slightly sweaty.",
        "It's toned, warm and smooth.",
        "Her mons is warm, and you can feel the texture of her pubic hair through the thin fabric of her jeans.",
        "Her lower back is slightly sweaty, and your hand slips ever so slightly into the top of her butt crack."
      ],
      "feelpee": [
        "You feel it clenching occasionally.",
        "You feel it suddenly firm with gooseflesh.",
        "You feel her muscles trembling under the smooth skin.",
        "It's swollen and rock hard.",
        "Her mons is burning, and she grinds it firmly back into you.",
        "You feel the top of her butt crack drenched in sweat."
      ],
      "feelbad": [
        "Hey! That tickles!",
        "No touchee!",
        "Stop it!",
        "Don't.  Just don't.",
        "Watch your hands, mister!",
        "What the?"
      ],
      "posenorm": [
        "girlname seems a bit at a loss, but she gamely turns slightly, sticks out her hip, and looks straight at you with a hand on her hip.",
        "girlname thinks a bit, turns her back to you, sticks out her chest and looks back over her shoulder, blowing you a kiss.",
        "girlname bends slightly at the waist with both hands on her hips, her butt sticking out and breasts hanging.",
        "girlname seductively turns and caresses her breast with one hand and her firm ass with the other.",
        "girlname grabs a chair and sits backwards, her legs spread wide open around the back, tight jeans showing every detail of her crotch.",
        "girlname seductively turns her back, bends over, and peels down her tight jeans just a little to give you a panty shot."],
      "poseoutfit": [
        "her jeans and t-shirt",
        "wedding dress",
        "pair of tight jeans and a tanktop",
        "one piece swimsuit",
        "pair of short shorts and a halter top",
        "grass hula skirt with a coconut bra"],
      "donoutfit": [
        "She slips out of her t-shirt, then pulls her tight jeans down around her ankles and steps out.  Lifting the wedding dress above her head, she burrows into the white pile of fabric until her head emerges from the top.  She reaches around to zip up the tight zipper and turns to look for your approval.",
        "She unzips the confining wedding dress and steps out of it, picking up the pair of jeans.  Turning her back to you, she bends over and steps into the jeans, pulling them over her hips and squirming them into place.  They are a tight fit, made even tighter when she pulls up the zipper and fastens the clasp.  The tanktop slips over her head moments later and she's set.",
        "She quickly pulls off the tank top and then unclasps, unzips, and peels off the jeans.  Hesitating slightly, she removes her undergarments and stands completely nude for a moment before stepping into the top of the swimsuit and pulling the straps over her shoulders.  It's a thin fabric that shows every line of her gorgeous body.",
        "She pulls the straps from her shoulders and peels the swimsuit down her legs.  Without stopping to pull her underwear back on, she steps first into the short shorts, and then pulls the tight halter top on over her head.  Her nipples show through the halter top, and you catch a glimpse of pink up the loose crotch of her shorts as she turns to look at you.",
        "She drops her shorts without even unzipping them and quickly wraps the grass skirt around her waist.  The coconuts quickly replace her halter top giving you a glimpse of her erect nipples before she turns towards you again."],
      "donemer": [
        [
          "She quickly slips out of her t-shirt, working her hips to keep her bladder under control, then pulls her tight jeans down around her ankles and quickly steps out.  Lifting the wedding dress above her head, she burrows into the white pile of fabric and you see her legs running in place under a plume of white lace until her head emerges from the top.",
          "She jams her hands into the fabric about where you expect her crotch to be. As the spasm subsides, she reaches around to zip up the tight zipper and turns to look for your approval, breathing hard."
        ],
        [
          "She unzips the confining wedding dress and steels herself before she steps out of it, dancing around a bit before picking up the pair of jeans.  Turning her back to you, she bends over and steps into the jeans, pulling them over her hips and squirming them into place.",
          "They are a tight fit, made even tighter against her swollen bladder when she pulls up the zipper and fastens the clasp with a gasp of effort.  She rubs her crotch through the thin fabric a couple of times and then removes her hands to slip the tanktop over her head moments later and she's set.  The bulge of her bladder and the mound of her pussy strain at the thin fabric."
        ],
        [
          "She quickly pulls off the tank top and then unclasps the jeans with a sigh of relief.  Unzipped and peel off quickly, the wadded up jeans are jammed between her legs for a few moments before being thrown to the side.",
          "Breathing heavily, she removes her undergarments and stands completely nude for a moment before stepping into the top of the swimsuit and pulling the straps over her shoulders, stretching the thin fabric into her crotch.  It's as if the suit actually makes the curve of her full bladder and lines of her straining pussy even more visible than when she was nude."
        ],
        [ "She tries to pull the straps from her shoulders with one hand while the other massages her crotch, but eventually has to free both hands to peel the swimsuit down her legs.  Without stopping to pull her underwear back on, she steps first into the short shorts, and then pulls the tight halter top on over her head.",
          "Her nipples show through the halter top, and she pulls up on the shorts until the crotch puts pressure on her pussy.  The pink skin and curly hair overflow past the thin straining fabric of the crotch."
        ],
        ["She drops her shorts without even unzipping them and quickly wraps the grass skirt around her waist.  She grabs a handful of the grass in a fist and jams it into her crotch for a moment before the coconuts replace her halter top and she stands there swaying back and forth."]],
      "fillchampok": [
        "She carefully fills the champagne flutes, pressing her body up to yours.",
        "She fills your flute, and then hers, catching a drip on her finger and sensously licking it off.",
        "She leans over you as she fills both flutes, offering you a view down her blouse.",
        "She kneels down to fill the flutes, and you can admire every curve of her butt outlines by her ultra-tight jeans.",
        "She sensually strokes her hand up and down the bottle before she picks it up and fills the flutes.",
        "She pours out two flutes worth and brings yours all the way up to your lips - her face within an inch of yours."],
      "peeprivate": [
        "You can imagine her panic in the bathroom as she sees the toilet and feels it starting to come out before she even has a chance to peel down her tight jeans",
        "You visualize her grabbing her crotch through her jeans the moment she sees the toilet and struggling to control it long enough to peel her jeans off",
        "You can imagine her finally relaxing over the toilet, pee pouring from her crotch for nearly a full minute.",
        "You can imagine her in front of the toilet, too desperate to even close the door before emptying her overfilled bladder",
        "You can only guess at her frenzied antics in front of the toilet as her struggling pee hole is finally allowed to relax and her full bladder empties into the toilet.",
        "You imagine her struggles to control herself just long enough to get her clothing out of the way before she empties her overtaxed bladder into the toilet."],
      "peeprivate2": [
        "You are left to imagine the her finding a stall, carefully closing the door and peeling down her tight jeans to use the toilet in private.",
        "You are left alone with only your imagination of her releasing her pent up pee into the toilet.",
        "You can only speculate what she's doing in there - Is there a line?  Does she consider the sink?  The floor drain?",
        "You can only fantasize about her final relief on the toilet - the pee pouring from her naked crotch",
        "You can just imagine the relief she feels as she pees in the privacy of the toilet.",
        "You can barely suppress the impulse to hold on to her - to follow her to the toilet where she quickly sits and empties her bladder."],
      "dryquote": [
        "She daintily fans at her soaked crotch with her hand a couple of times, as if to dry it out.",
        "She wipes the soaked crotch of her jeans with her hand, flinging the fragrant drops to the ground.",
        "She presses her soaked jeans into her pussy and drops of pee well up and fall to the ground.",
        "She fans her crotch with her hand, as if to dry out her soaked jeans.",
        "She wipes at her soaked thighs with the back of her hand and then flings the drops to the ground.",
        "She feels her butt and the back of her jeans for a wet patch.  They're soaked, but it's difficult to tell."],
      "peeshotquote": "She hurriedly grabs the shot glass and quickly rips down her tight jeans and {0} panties as she holds the edge of the glass against her pink pussy lips.",
      "peeshotquotebare": "She grabs the shot glass and quickly rips down her tight jeans, holding the edge of the glass against her suddenly bare pussy.",
      "peevasequote": "She sets the vase on the floor and rips down her tight jeans, quickly pulling her {0} panties down around her ankles as well.  She carefully squats above the vase, its edge barely touching her pink pussy lips.",
      "peevasequotebare": "She sets the vase on the floor and rips down her tight jeans, revealing her bare crotch.  She carefully squats above the vase, its edge barely touching her pink pussy lips.",
      "peetowelquote": "She hurriedly pulls down her jeans and {0} panties in a single motion, jamming the paper towels between her legs and pressing them into her struggling crotch.",
      "peetowelquotebare": "She hurriedly pulls down her tight jeans, jamming the roll of paper towels directly onto her bare pussy lips.",
      "peechampquote": "Grabbing the champagne glass she quickly rips down her tight jeans and {0} panties as she presses the mouth of the glass against her pussy lips.",
      "peechampquotebare": "She grabs the champagne glass and and quickly rips down her tight jeans, holding the edge of the glass against her bare pussy.",
      "peeoutsidequote": "She steps gingerly out of the car drops her tight jeans and {0} panties down around her ankles.  She carefully squats, looking around to make sure that nobody is watching.",
      "peeoutsidequotebare": "She hops quickly out of the car and drops her tight jeans, revealing her bare crotch.  She carefully squats, quickly glancing around to make sure she's really not being watched.",
      "peeoutsidebquote": "She pulls down her jeans and pantyColor panties around her ankles.  She carefully squats, looking around to make sure that nobody is watching.",
      "peeoutsidebquotebare": "She rips down her jeans, revealing her bare crotch.  She carefully squats, quickly glancing around to make sure she's really not being watched.",
      "wetherselfquote": "She takes off her jeans and slowly peels her soaked  {0} panties down her dripping legs, holding them daintily between her thumb and forefinger.",
      "firstmtgquote": " greets you at the door.  She's wearing a pair of tight blue jeans and an even tighter black form-fitting t-shirt.",
      "firstmtgtightquote": "The jeans are so tight you can see the outlines of her pantyColor panties.",
      "firstmtgtightquotebare": "You don't see any pantylines, despite the skin-tight jeans.",
      "soakedseatquote": "She nervously brushes at her jeans before she gingerly sits on the soaked passenger seat.",
      "peeprepquote": "She squirms out of her jeans and pulls her panties down with them.",
      "peeprepquotebare": "She hikes squirms out of her jeans and you can just barely see her bare pussy in the dim light.",
      "undressquote": " strips off her t-shirt and jeans, then shyly unclasps her bra, revealing her breasts briefly before turning her back to you.",
      "undressquoteemer": " quickly peels off her t-shirt and throws it aside before grabbing at her crotch through the fabric of her tight jeans.  She bends over for a bit, and then gingerly squirms out of the jeans as well, her legs held closed as tightly as possible.",
      "ptogetherquote": " rips down her skin-tight jeans and {0} panties, and is pissing like a racehorse before she even fully sits down on the seat.",
      "ptogetherquotebare": " yanks down her skin-tight jeans, and is pissing like a racehorse before she even fully sits down on the seat.",
      "ptogetheroutquote": "Her bladder can't be ignored, and she pulls her jeans and panties down around her ankles, quickly sqatting on the ground.",
      "ptogetheroutquotebare": "Her bladder can't be ignored, and she pulls her jeans down to reveal her bare pussy, squatting quickly on the ground.",
      "finishtogetheroutquote": "She gets up and re-adjusts her panties over her still-damp crotch, pulling her tight jeans firmly back into place.",
      "finishtogetheroutquotebare": "She gets up and pulls on her jeans, checking for dampness soaking into the crotch.",
      "ptogetherdumpquote": "You quickly help her pull down her skin-tight jeans and reach between her legs, running your hand up her hot and sweaty thighs to the damp gusset of her {0} panties.",
      "ptogetherdumpquotebare": "You quickly help her pull her skin-tight jeans aside and reach between her legs, running your hand up her hot and sweaty thighs to reach the soft, moist flesh of her cunt.",
      "finishtogetherdumpquote": "A huge puddle has formed as she squeezes off the last drops, and you wipe her pussy with your finger before smoothing her panties back into place and helping squeeze her back into the skin-tight blue jeans.",
      "finishtogetherdumpquotebare": "A huge puddle has formed as she squeezes off the last drops, and you wipe her pussy with your finger before helping to squeeze her back into the skin-tight blue jeans.",
      "sextakeoffskirt": "Take off her jeans",
      "sextakeofftop": "Take off her t-shirt",
      "sextakeoffpanties": "Take off her panties",
      "sextakeoffbra": "take off her bra",
      "sextBreasttop": "You massage her breasts through her t-shirt.",
      "sextBreastbra": "You rub her nipples through the silky lace of her bra.",
      "sextThigh": "You slip your hand between her legs and slide it up her inner thighs, feeling the smooth fabric of her jeans.",
      "sextAssskirt": "You massage her ass through the thin fabric of her tight jeans.",
      "sextAsspanties": "You rub her ass though the silky fabric of her panties.",
      "sextPussyskirtpanties": "You reach between her legs and massage her pussy through the thin fabric of her skin-tight jeans and panties.",
      "sextPussyskirtnotpanties": "You reach between her legs and massage her pussy through the fabric of her skin-tight jeans.",
      "sexkThighskirt": "You lay your head in her lap and rub your cheek on her inner thigh through the thin fabric of her tight jeans.",
      "sexkPussyskirt": "You bury your face in her lap in a vain attempt to stretch the fabric of her jeans, but instead you just put pressure on her bladder.",
      "sexkPussypanties": "You lay your face in her lap and tongue her pussy though the silky wet fabric of her panties.",
      "sextoskirtquoteemer": "The bulge of her overfull bladder is stretching out the waistband of her skin-tight jeans and making the zipper difficult to operate.",
      "sexskirtpanties": "You unzip and tug down her skin-tight jeans to reveal her pantyColor panties beneath.",
      "sexskirtnone": "You unzip and pull down her skin-tight jeans like you were unwrapping a present.  Beneath them you find her curly pubes and nothing else.",
      "sexPantieTOSkirt": "You reach down the back of her tight jeans and try to tug her panties out, but they seem to be stuck.",
      "swimstripquote":" is already peeling off her t-shirt and jeans.",
      "swimstripquotebare": "She hesitates a second and then removes her lacy bra.  She stands completely naked, but it's difficult to see much in the warm darkness.",
      "swimstripquotepanties": "She hesitates a second and then removes her lacy bra, leaving her pantyColor panties on."
    },
    "skirt": {
      "thighresp": [
        "She spreads her legs slightly, inviting your hand a bit higher.",
        "She places her hand on yours and moves it a little further between her legs.",
        "She shifts in her chair, pressing your hand between her smooth legs.",
        "Her breathing becomes audible and you feel the heat of her body under the skirt.",
        "She moves in her chair and your hand is suddenly under her skirt.",
        "She lets out a barely audible sigh and you feel gooseflesh form under your fingers."],
      "feelher": [
        "You put your hand on her butt.",
        "You reach around and put your hand on her breast.",
        "You put your hand on her thigh",
        "You reach around and put your hand on her belly.",
        "You press your body against her pubes.",
        "You slide your hand down under the elastic of her skirt."],
      "feelres": [
        "It's tight and smooth beneath her thin skirt.",
        "It's warm and soft.  You feel the erect nipple through her blouse, and give it a tweak as your hand passes over.",
        "The skin is smooth and supple ... and just slightly sweaty.",
        "It's toned, warm and smooth.",
        "Her mons is warm, and you can feel the texture of her pubic hair.",
        "Her lower back is slightly sweaty, and your hand slips ever so slightly into the top of her butt crack."],
      "feelpee": [
        "You feel it clenching occasionally.",
        "You feel it suddenly firm with gooseflesh.",
        "You feel her muscles trembling under the smooth skin.",
        "It's swollen and rock hard.",
        "Her mons is burning, and she grinds it firmly back into you.",
        "You feel the top of her butt crack drenched in sweat."],
      "posenorm": [
        "girlname seems a bit at a loss, but she gamely turns slightly, sticks out her hip, and looks straight at you with a hand on her hip.",
        "girlname thinks a bit, turns her back to you, sticks out her chest and looks back over her shoulder, blowing you a kiss.",
        "girlname bends slightly at the waist with both hands on her hips, her butt sticking out and breasts hanging.",
        "girlname seductively turns and caresses her breast with one hand and her firm ass with the other.",
        "girlname grabs a chair and sits backwards, her legs spread wide open around the back.",
        "girlname seductively turns her back, bends over, and flips up the back of her skirt to give you a panty shot."],
      "poseoutfit": [
        "her skirt and blouse",
        "wedding dress",
        "pair of tight jeans and a tank-top",
        "one piece swimsuit",
        "pair of short shorts and a halter top",
        "grass hula skirt with a coconut bra"],
      "donoutfit": [
        "",
        "She unbuttons and removes her blouse, then pulls her skirt down around her ankles and steps out.  Lifting the wedding dress above her head, she burrows into the white pile of fabric until her head emerges from the top.  She reaches around to zip up the tight zipper and turns to look for your approval.",
        "She unzips the confining wedding dress and steps out of it, picking up the pair of jeans.  Turning her back to you, she bends over and steps into the jeans, pulling them over her hips and squirming them into place.  They are a tight fit, made even tighter when she pulls up the zipper and fastens the clasp.  The tanktop slips over her head moments later and she's set.",
        "She quickly pulls off the tank top and then unclasps, unzips, and peels off the jeans.  Hesitating slightly, she removes her undergarments and stands completely nude for a moment before stepping into the top of the swimsuit and pulling the straps over her shoulders.  It's a thin fabric that shows every line of her gorgeous body.",
        "She pulls the straps from her shoulders and peels the swimsuit down her legs.  Without stopping to pull her underwear back on, she steps first into the short shorts, and then pulls the tight halter top on over her head.  Her nipples show through the halter top, and you catch a glimpse of pink up the loose crotch of her shorts as she turns to look at you.",
        "She drops her shorts without even unzipping them and quickly wraps the grass skirt around her waist.  The coconuts quickly replace her halter top giving you a glimpse of her erect nipples before she turns towards you again."],
      "donemer":[
        "",
        "She unbuttons and removes her blouse, working her hips to keep her bladder under control, then pulls her skirt down around her ankles and quickly steps out.  Lifting the wedding dress above her head, she burrows into the white pile of fabric and you see her legs running in place under a plume of white lace until her head emerges from the top and she jams her hands into the fabric about where you expect her crotch to be.  As the spasm subsides, she reaches around to zip up the tight zipper and turns to look for your approval, breathing hard.",
        "She unzips the confining wedding dress and steels herself before she steps out of it, dancing around a bit before picking up the pair of jeans.  Turning her back to you, she bends over and steps into the jeans, pulling them over her hips and squirming them into place.  They are a tight fit, made even tighter against her swollen bladder when she pulls up the zipper and fastens the clasp with a gasp of effort.  She rubs her crotch through the thin fabric a couple of times and then removes her hands to slip the tanktop over her head moments later and she's set.  The bulge of her bladder and the mound of her pussy strain at the thin fabric.",
        "She quickly pulls off the tank top and then unclasps the jeans with a sigh of relief.  Unzipped and peel off quickly, the wadded up jeans are jammed between her legs for a few moments before being thrown to the side.  Breathing heavily, she removes her undergarments and stands completely nude for a moment before stepping into the top of the swimsuit and pulling the straps over her shoulders, strething the thin fabric into her crotch.  It's as if the suit actually makes the curve of her full bladder and lines of her straining pussy even more visible than when she was nude.",
        "She tries to pull the straps from her shoulders with one hand while the other massages her crotch, but eventually has to free both hands to peel the swimsuit down her legs.  Without stopping to pull her underwear back on, she steps first into the short shorts, and then pulls the tight halter top on over her head.  Her nipples show through the halter top, and she pulls up on the shorts until the crotch puts pressure on her pussy.  The pink skin and curly hair overflow past the thin straining fabric of the crotch.",
        "She drops her shorts without even unzipping them and quickly wraps the grass skirt around her waist.  She grabs a handfull of the grass in a fist and jams it into her crotch for a moment before the coconuts replace her halter top and she stands there swaying back and forth."],
      "fillchampok": [
        "She carefully fills the champagne flutes, pressing her body up to yours.",
        "She fills your flute, and then hers, catching a drip on her finger and sensuously licking it off.",
        "She leans over you as she fills both flutes, offering you a view down her blouse.",
        "She kneels down to fill the flutes, and her skirt rides up giving you a nice view.",
        "She sensually strokes her hand up and down the bottle before she picks it up and fills the flutes.",
        "She pours out two flutes worth and brings yours all the way up to your lips - her face within an inch of yours."],
      "peeprivate": [
        "You can imagine her panic in the bathroom as she sees the toilet and feels it starting to come out before she even has a chance to peel down her skirt",
        "You visualize her grabbing her crotch through her skirt the moment she sees the toilet and struggling to control it long enough to get her skirt off",
        "You can imagine her finally relaxing over the toilet, pee pouring from her crotch for nearly a full minute.",
        "You can imagine her in front of the toilet, too desperate to even close the door before emptying her overfilled bladder",
        "You can only guess at her frenzied antics in front of the toilet as her struggling pee hole is finally allowed to relax and her full bladder empties into the toilet.",
        "You imagine her struggles to control herself just long enough to get her clothing out of the way before she empties her overtaxed bladder into the toilet."],
      "peeprivate2": [
        "You are left to imagine the her finding a stall, carefully closing the door and hiking up her skirt to use the toilet in private.",
        "You are left alone with only your imagination of her releasing her pent up pee into the toilet.",
        "You can only speculate what she's doing in there - Is there a line?  Does she consider the sink?  The floor drain?",
        "You can only fantasize about her final relief on the toilet - the pee pouring from her naked crotch",
        "You can just imagine the relief she feels as she pees in the privacy of the toilet.",
        "You can barely suppress the impulse to hold on to her - to follow her to the toilet where she quickly sits and empties her bladder."],
      "dryquote": [
        "She daintily flaps her skirt a couple of times to air out her soaking crotch.",
        "She wipes her crotch with her hand, flinging the fragrant drops to the ground.",
        "She presses her skirt to her pussy and drops of pee soak into the fabric.",
        "She fans her crotch with her hand, as if to dry out her soaked pubes.",
        "She wipes at her thighs with the back of her hand and then dries it off on the fabric of her skirt.",
        "She feels the back of her skirt for a wet patch.  It doesn't seem like there's much damage."],
      "peeshotquote" : "She hurriedly grabs the shot glass and quickly lifts her skirt, pulling aside her {0} panties as she holds the edge of the glass against her pink pussy lips.",
      "peeshotquotebare" : "She grabs the shot glass and quickly lifts her skirt, holding the edge of the glass against her bare pussy.",
      "peevasequote" : "She sets the vase on the floor and lifts up her skirt, quickly pulling her {0} panties down around her ankles.  She carefully squats above the vase, its edge barely touching her pink pussy lips." ,
      "peevasequotebare" : "She sets the vase on the floor and lifts up her skirt, revealing her bare crotch.  She carefully squats above the vase, its edge barely touching her pink pussy lips.",
      "peetowelquote" : " hurriedly lifts up her skirt, jamming the paper towels between her legs and pressing it into the crotch of her {0} panties.",
      "peetowelquotebare" : " hurriedly lifts up her skirt, jamming the roll of paper towels directly onto her bare pussy lips.",
      "peechampquote": "Grabbing the champagne glass, she lifts her skirt, pulling aside her {0} panties as she presses the mouth of the glass against her pussy lips",
      "peechampquotebare": "She grabs the champagne glass and lifts her skirt. Pressing the glass against her bare pussy.",
      "peeoutsidequote" : "She steps gingerly out of the car lifts up her skirt, quickly pulling her {0} panties down around her ankles.  She carefully squats, looking around to make sure that nobody is watching.",
      "peeoutsidequotebare" : "She hops quickly out of the car and lifts up her skirt, revealing her bare crotch.  She carefully squats, quickly glancing around to make sure she's really not being watched.",
      "peeoutsidebquote" : "She lifts up her skirt, pulling her {0} panties down around her ankles.  She carefully squats, looking around to make sure that nobody is watching.",
      "peeoutsidebquotebare" : "She lifts up her skirt, revealing her bare crotch.  She carefully squats, quickly glancing around to make sure she's really not being watched.",
      "wetherselfquote" : "She lifts her skirt and slowly peels her soaked {0} panties down her dripping legs, holding them daintily between her thumb and forefinger.",
      "firstmtgquote" : " greets you at the door.  She's wearing a short black skirt and tight white blouse.",
      "firstmtgtightquote" : "The skirt is so tight you can see the outlines of her {0} panties.",
      "firstmtgtightquotebare" : "You don't see any pantylines, despite the tight skirt.",
      "soakedseatquote" : "She pulls her skirt out of the way and gingerly sits on the soaked passenger seat.",
      "peeprepquote" : "She hikes her skirt up and pulls her panties down around her ankles.",
      "peeprepquotebare" : "She hikes her skirt up and you can just barely see her bare pussy in the dim light.",
      "undressquote" : " strips off her top and skirt, then shyly unclasps her bra, revealing her breasts briefly before turning her back to you.",
      "undressquteemer" : " quickly peels off her top and throws it aside before grabbing her crotch through the fabric of her skirt.  She bends over for a bit, and then gingerly pulls the skirt down, her legs held tightly together.",
      "ptogetherquote" : " rips down her skirt and {0} panties, and is pissing like a racehorse before she even fully sits down on the seat.",
      "ptogetherquotebare" : " yanks up her skirt, and is pissing like a racehorse before she even fully sits down on the seat.",
      "ptogetheroutquote": "Her bladder can't be ignored, and she pulls her panties down around her ankles, quickly sqatting and lifting up her skirt.",
      "ptogetheroutquotebare" : "Her bladder can't be ignored, and she squats, lifting up her skirt to reveal her bare pussy.",
      "finishtogetheroutquote" : "She gets up and re-adjusts her panties over her still-damp crotch, letting her skirt fall loosely back into place.",
      "finsihtogetheroutquotebare" : "She gets up and smoothes her skirt to hide her still-damp crotch.",
      "ptogetherdumpquote" : "You reach quickly under her skirt, running your hand up her hot and sweaty thighs to the damp gusset of her {0} panties.",
      "ptogetherdumpquotebare" : "You reach quickly under her skirt, running your hand up her hot and sweaty thighs to reach the soft, moist flesh of her cunt.",
      "finishtogetherdumpquote" : "A huge puddle has formed as she squeezes off the last drops, and you wipe her pussy with your finger before smoothing her panties back into place and tugging her skirt into position.",
      "finishtogetherdumpquotebare" : "A huge puddle has formed as she squeezes off the last drops, and you wipe her pussy with your finger before letting her skirt fall back down.",
      "sextakeoffskirt" : "Take off her skirt",
      "sextakeofftop" : "Take off her blouse",
      "sextakeoffpanties": "Take off her panties",
      "sextakeoffbra": "take off her bra",
      "sextBreasttop": "You massage her breasts through the thin fabric of her blouse.",
      "sextBreastbra": "You rub her nipples through the silky lace of her bra.",
      "sextThigh" : "You slip your hand under her skirt and slide it up her inner thighs.",
      "sextAssskirt" : "You massage her ass through the thin fabric of her skirt.",
      "sextAsspanties": "You rub her ass though the silky fabric of her panties.",
      "sextPussyskirtpanties" : "You reach under her skirt and massage her pussy through the thin fabric of her panties.",
      "sextPussyskirtnotpanties": "You reach under her skirt and massage her pussy.",
      "sexkThighskirt" : "You lay your head in her lap and rub your cheek on her inner thigh through the thin fabric of her skirt.",
      "sexkPussypanties": "You lay your face in her lap and tongue her pussy though the silky wet fabric of her panties.",
      "sexkPussyskirt" : "You bury your face in her lap in a vain attempt to stretch her skirt, but instead you just put pressure on her bladder.",
      "sexskirtquoteemer" : "The bulge of her overfull bladder is stretching out her skirt on top and making the zipper difficult to operate.",
      "sexskirtpanties" : "You unzip and tug down her skirt to reveal her {0} panties beneath.",
      "sexskirtnone" : "You unzip and pull down her skirt like you were unwrapping a present.  Beneath it you find her curly pubes and nothing else.",
      "sexPantiesTOSkirt" : "You reach up under her skirt and try to tug her panties down, but they seem to be stuck.",
      "swimstripquote" : " is already peeling off her blouse and skirt.",
      "swimstripquotebare" : "She hesitates a second and then removes her lacy bra.  She stands completely naked, but it's difficult to see much in the warm darkness.",
      "swimstripquotepanties" : "She hesitates a second and then removes her lacy bra, leaving her {0} panties on."
    }
  }
}