{
  "ypredrink": [[
    "You drink two glasses of water, hoping it will go through you quickly."
  ],
  [
    "You considering drinking some water to get your bladder filled quicker.",
    "But your stomach feels way to full to add more."
  ]],
  "champagne": [
    ["You suggest having some champagne."],
    ["She smiles and goes into the kitchen to get some glasses."],
    ["You toast and enjoy the champagne together."],
    ["She drinks the champagne with you after a hurried toast."],
    ["girltalk I can't even <i>think</i> about champagne"],
    ["She tosses back the champagne quickly, dropping the glass onto the floor."]
  ],
  "wonderWhy": [
    "I shouldn't be doing this!" ,
    "This is <b>so</b> hard!" ,
    "Why am I doing this???" ,
    "This is crazy, but I love it!" ,
    "I'm such a ditz!",
    "I must be nuts."],
  "cantDo":[
    "I can't even think straight!",
    "I can't even walk right!" ,
    "I can't stop moving or..." ,
    "I'm out of control!" ,
    "I've got to concentrate on the task at hand." ,
    "I'm trembling all over."],
  "fillChamp": [
    "She bends over to fill the glasses, jamming one hand into her crotch.",
    "She fills both glasses and you can see her hand shaking with the effort to control herself." ,
    "She fills both glasses, the bottle rattling against their rims as she shudders in an effort of self control." ,
    "She quickly sits on her heel and fills the glasses kneeling in front of you.",
    "She jerks her ass back and forth violently as she bends over to fill both glasses.",
    "She nearly drops the bottle and her whole body shudders violently as she fills both glasses."],
  "fillChampBad": ["She's gasping for breath as she fills both glasses, sloppily spilling most of it onto the table top." ,
    "She bends over to fill both glasses and stumbles backwards, spilling champagne onto the floor.",
    "She kneels and presses her pussy into the corner of the coffee table as she fights for control while filling both glasses.",
    "She jams the champagne bottle into her crotch and holds very still for a few seconds before splashing the drink in the direction of the glasses, spilling most of it onto the floor." ,
    "She sits down heavily on the coffee table as she fills the glasses, shuddering and spilling most of it onto the floor.",
    "She holds the bottle pressed to her crotch as she raises the glasses and tries to fill them, spilling most of it onto the floor."]
}