{
  "theTub": {
    "intro": [
      [["You pull girlname on your lap."]],
      ["girlname is sitting on your lap... naked."]
    ],
    "maxKiss": [
      "girlname suddenly pulls away, moving off your lap to sit back next to you again.",
      "girltalk I'm sorry, this just isn't happening."
    ],
    "arousal": ["She is extremely turned on, but still doesn't seem to want to take things any further in the hot tub."],
    "leave": "Lift her off of your lap.",
    "leaveSex": ["You both sit there for a few seconds, trying to catch your breath."]
  },
  "theBeach": {
    "intro": [
      [
        ["girlname collapses onto the soft sand, pulling you on top of her."],
        ["girlname pulls you down onto the soft sand."]
      ],
      ["You are lying on the beach with girlname"]
    ],
    "maxKiss": [
      "girlname suddenly pulls away from you and sits up.",
      "girltalk You know, this just isn't working out."
    ],
    "arousal": ["She seems madly hot, but still reluctant to take that last step out here on the beach."],
    "leave": "Get back up and dust yourself off.",
    "leaveSex": [
      "You both slowly get up from the sand and dust yourselves off.",
      "You put yourself back together and help girlname make herself presentable."
    ]
  },
  "theBed": {
    "intro": [
      [
        ["girlname collapses on the bed, pulling you on top of her."],
        ["girlname pulls you down onto the bed."]
      ],
      ["You are in bed with girlname"]
    ],
    "maxKiss": [
      "girlname suddenly pulls away from you and sits up in bed.",
      "girltalk You know, this just isn't working out.",
      "girltalk I'm afraid we're going to have to call it a night."
    ],
    "arousal": ["girltalk <i>Hurry!</i> Fuck me <b>NOW</b>!"]
  },
  "arousal": [
    ["She seems very aroused."],
    ["She seems extremely aroused."],
    ["She seems unbelievably aroused."],
    ["She seems earthshatterinly aroused."]
  ],
  "fuckTry": [
    "You try to push your cock into her pussy, but she pushes you away.",
    "girltalk Not here. Later."
  ],
  "followBed": "You follow her closely back to her bedroom.",
  "bedroomDesp": "She presses her crotch into the bedpost.",
  "bedroomNorm": "She looks at you romantically with a cute little smile.",
  "areBedroom": "You are with girlname in her bedroom.",
  "choices": {
    "allowPee": "Tell her she can go and pee.",
    "holdIt": "Ask her to hold it.",
    "theBed": "Kiss her."
  },
  "clothes": {
    "top": [
      [
        [ "You slowly unbutton and remove her top, making sure to feel her up on the way past her breasts.  Her breasts are gorgeous and firm beneath the lace of her bra."],
        [
          "girltalk <i>Hurry</i> - I can't hold it much longer.",
          "She looks like she's going to burst any second."
        ],
        [ "girlname rubs her hands over your chest and begins to unbutton your shirt."]
      ]
    ],
    "skirt": [
      [
        [],
        [ "She momentarily catches her breath as a small bit of the pressure is reduced."],
        [ "girlname works at unzipping your pants, stroking your shaft though the cloth."],
        [ "The waistband is soaked with sweat from her exertions."]
      ],
      [
        [],
        [ "It's spasmodically contracting as she fights to hold her pee."],
        [ "girlname unfastens your pants and pulls at your boxers, freeing your dick and stroking the shaft lightly."]
      ]
    ],
    "bra": [
      [
        [ "You pull at her bra to very little effect.  Could it be she's still wearing her blouse?"],
        [ "UNGGGGHHHH! She grunts with the effort of holding it in."],
        [
          "girltalk Having some technical difficulties?",
          "She giggles."
        ]
      ],
      [
        [ "You reach around behind her and find... that it's a front snap bra. Problem is quickly solved ( good thinking! ) and you unsnap it between her shapely round breasts."],
        [ "Her chest is flushed, rising and falling quickly as she pants."],
        [ "She rips at your shirt and runs her cool hands all over your chest."]
      ]
    ],
    "panties": [
      [
        [],
        [ "She suddenly slams her legs together.",
          "girltalk What are you doing?! I'm nearly wetting myself!"
        ],
        []
      ],
      [
        [ "You slip her damp panties down to reveal her curly pubes and moist warm pussy."],
        [ "It's spasmodically contracting as she fights to hold her pee."],
        [ "girlname pulls at your boxers, freeing your dick and stroking the shaft lightly."],
        [ "Her panties are stretched around the bulge of her unbelievably round and hard bladder."]
      ]
    ]
  },
  "actions": {
    "kNeck": [
      [
        ["You nibble delicately on her neck."],
        ["Goosebumps suddenly form and her whole body shakes uncontrollable for a second."],
        ["She seems to like it."]
      ]
    ],
    "tThigh": [
      [
        [],
        [ "They are wet and slippery.  You pull your hand back out and smell her sweat.  No pee yet, you think."],
        [ "She moans and quivers with delight.",
          "girltalk That feels <i>so</i> good!"
        ]
      ],
      [
        [ "You slide your hand up her inner thighs."],
        [ "She suddenly clamps her legs together, trapping your fingers.",
          "She squirms back and forth, trying to find a comfortable position, and pulling your arm around as she does it.",
          "girltalk Oops. I have to go <i>sooooo</i> bad I almost lost it for a second there.  Here's your arm back."
        ],
        [
          "She moans and quivers with delight.",
          "girltalk That feels <i>so</i> good!"
        ]
      ]
    ],
    "kPussy": [
      [
        [],
        ["She groans and tries to push your head away"],
        ["You smell the fragrance of her pee remaining from when she wet herself."]
      ],
      [
        [ "You lay your face in her lap and tongue her pussy though the silky wet fabric of her panties."],
        [
          "She suddenly squeezes her legs together and pushes your head out.",
          "girltalk Sorry! I just <i>had</i> to do that! I'm losing control!"
        ],
        [ "You tongue finds her swollen clit through the thin cloth."],
        [ "You smell the fragrance of her pee remaining from when she wet herself."]
      ],
      [
        [ "You brush your lips over her fragrant pussy before burying your tongue in her dripping cunt."],
        [ "The quivering you feel through your tongue reminds you of the overfilled reservoir of pee that is barely controlled just inches away from your lips."],
        [ "You smell the fragrance of her pee remaining from when she wet herself."],
        [ "It tastes of salt, and slightly sweet. She gasps with sudden pleasure."],
        [ "girltalk Oh God! Oh God! Stop stop stop stop.",
          "She suddenly slams her thighs together and pushes your head out.",
          "girltalk Sorry sorry sorry. I almost let a squirt out. I'm <i>so</i> full!!"
        ]
      ]
    ],
    "kBreast": [
      [
        ["You bring your mouth up to her breasts and blow warm air through thin fabric of her blouse.  You can feel her nipples stiffen at the contact."]
      ],
      [
        ["You lick her nipples through the rough lace of her bra."]
      ],
      [
        ["You suck and lick her stiff nipples and she moans in pleasure."],
        ["They taste salty and sweet with her sweat."],
        []
      ]
    ],
    "kThigh": [
      [],
      [
        ["You slide your cheek up her inner thighs, licking and kissing them passionately until you feel the heat of her pussy on your forehead."],
        ["Her thighs are quivering with the effort keep her legs open and still clamp her pee hole shut."],
        []
      ]
    ],
    "tPussy": [
     [],
     [
       [ "You stroke her burning pussy though the silky wet fabric of her panties."],
       [ "She grabs your hand and presses it into her crotch.  You can feel her pee hole as a tight quivering bump right under your index finger.",
         "girltalk You have to help me hold it!"
       ],
       [  "She presses her cunt into your hand and reaches over to massage your dick."]
     ],
     [
       [  "Your hand reaches up to firmly massage her dripping cunt as she moans in pleasure."],
       [  "She grabs your hand and presses it more firmly into her crotch.  You can feel her pee hole as a tight quivering bump right under your index finger.",
         "girltalk You have to help me hold it!"
       ],
       [ "You feel the bump of her erect clit pulsing beneath your fingers."]
     ]
    ],
    "tAss": [
      [
        [],
        ["Her butt cheeks are clenching and releasing, as she struggles to hold her bursting bladder."],
        ["The silky cloth slides easily over her smooth cheeks and she presses into your hands."]
      ],
      [
        [],
        ["The panties are damp with her sweat."],
        ["The thin cloth slides easily over her smooth cheeks and your fingers find their way underneath."]
      ],
      [
        ["You grab her ass and your fingers slide towards her hot cunt from the rear."],
        ["Her butt clenches and your fingers seem stuck before they slide back out, lubricated by her sweat."],
        ["She gasps: That's so <i>good</i>!"]
      ]
    ],
    "tBreast": [
      [], [],
      [
        ["You twirl your finger around her erect nipples and she moans in pleasure."],
        ["girlname moans: Yes! Harder! I can't control it much longer."],
        ["You didn't think it was possible, but her nipples are now even harder and sticking out even further."]
      ]
    ]
  },
  "fuckNow": [
    [ "You pull her on top of you and gently push your cock into her soft and wet pussy. It feels <i>so</i> good."],
    [ "Her rock hard bladder rubs against your shaft through the thin wall of her vagina."],
    [
      "The spasms as she fights her impulse to pee combined with the thought that she's within seconds of wetting the bed with you inside her does things to you.",
      "You balls tighten in warning, and you know you're not going to last."
    ],
    [ "She moans with pleasure, causing heat to shoot through your spine. You can feel yourself getting close."],
    [
      "You keep pumping.",
      "And you can't hold back. Pleasure explodes from cock, pulsing deep inside of her."
    ],
    [
      "The sudden shock is too much for her and you feel the pee flowing from her cunt, wetting your softening dick.",
      "Her warm urine flows down the lips of her pussy and your dick, dripping onto the mattress.",
      "She's wet the bed."
    ],
    [
      "You both lie there catching your breath.",
      "The sheets are warm and soaked, her fragrance heavy in the air.",
      "girltalk Well.... that was certainly interesting."
    ],
    [
      "She arches her back and screams in ecstasy, pulsing around your dick before collapsing back onto the bed, breathing hard.",
      "You both lie there in bed for a few moments, catching your breath. Neither of you in a hurry to move."
    ],
    [
      "Propping yourself up on your fist, you gently cup her belly in your hand and feel a slight bulge, but girlname makes no move to get up right away.",
      "You secretly wish she had been desperate when she came."
    ],
    [ "Turning towards her you gently rub your hand over her tight and flat belly. She seems in no hurry to get up.",
      "In the back of your mind you think that it would've been kinda cool if she had been desperate for a pee"
    ],
    [ "You stop moving for a second, trying to stave off your orgasm."],
    [ "girlname hisses: Hurry! It's coming out!!!"],
    [ "girlname whines in frustration: No! Don't stop!"],
    [
      "With a deep breath you start moving again, the intoxicating combination of her struggle for control and the knowledge that she's on the edge of wetting the bed have you almost immediately as close as before.",
      "girltalk Please. Stop. It's <b>so</b> good, but I can't hold it anymore!"
    ],
    [
      "Feeling a bit more in control, you start moving again. Her hot pulsing pussy feels heavenly around your cock.",
      "You reach up to fondle her breasts, you can feel your orgasm approaching.",
      "Her walls start to flutter around your cock and she moans loudly: Oh! god! <i>I'm gonna cum</i>"
    ],
    [
      "girlname squeals: <b>NO!</b> <i>It's coming out!</i>",
      "First a long squirt escapes from her piss hole, and then another.",
      "Suddenly it turns into a full on stream and she collapses back on the back as her piss wets your cock and cascades down for almost a minute. Drenching the sheets.",
      "girlname lies there in relief ... not caring all that much.",
      "She's wet the bed."
    ],
    [ "You pause for a second."],
    [
      "girlname takes a deep breath, and you her hear quietly counting to 3.",
      "girltalk That would be more fun, wouldn't it?",
      "She smiles at you, slightly breathlessly.",
      "girltalk Okay. I'm going to try.",
      "girltalk But promise you won't be mad if I can't hold it."
    ],
    [ "girlname takes a deep breath. Then she gasps."],
    [
      "girlname smiles at you as she slowly climbs back on the bed,",
      "Hovering above you she captures your lip into a passionate kiss and your dick slips inside her warm pussy again",
      "You grab her hips as she rides you. Feeling yourself get lost in the sensation.",
      "\"I'm so close\" she whispers breathlessly.",
      "girlname cries out and you feel her walls contract around your penis, taking you with her into the throws of orgasm.",
      "As she comes down she collapses on top of you, and you slowly rub her back as you try to catch your breath.",
      "That had been amazing.",
      "In the back of your mind you wonder if it would've been even better if you had let her hold her bladder after all."
    ],
    [ "girlname pulls you closer into a heated kiss and you start moving again, revelling in the amazing friction between the two of you",
      "She moans in pleasure, and you can sense that she's close as your own orgasm is approaching.",
      "Moving your hand between the two of you, you rub her clit, hoping to push her over the edge."
    ],
    [ "A spurt of pee escapes her, wetting your hand and dick slightly."],
    [
      "Your mind clouds over, the knowledge that she's holding back an ocean of piss in her bladder is almost to much for you to handle.",
      "Pleasure is shooting through your spine, pooling down into your balls.",
      "Until it suddenly explodes outward, you stiffen as your cock pulses inside of her.",
      "You are barely aware of her crying out, following you over the edge her walls contracting around your still pulsing penis.",
      "Drained you collapse on top of her, trying to catch your breath for a few seconds."
    ],
    [
      "In your post-orgasm haze you are barely aware as a spurt of pee shoots out of her, wetting your softening cock."
    ],
    [
      "Taking a deep breath you pull out and roll over to lie next to her, not wanting to crush her."
    ],
    [ "You close your arms around her, cuddling her. But she gasps slightly and tries to pull away.",
      "girlgasp Oh god! It's coming out. I can't. Hng. Hang on!!",
      "You quickly release her and she sprints of the bed, hands pressed into her crotch to help her hold it just a few more seconds.",
      "The bathroom is only a few steps from the bed, which is probably the only reason she still has a chance to make it.",
      "She is too far gone to even bother to close the door. Giving you a clear view as she rushes over to the toilet.",
      "You can see her stream starting for she full menages to sit down.",
      "Her legs are slightly open, and she leans back in full bliss. Giving you a view of her crotch as pee runs out of her pee hole.",
      "You can't shake the thought that she held all of that just for you. And you start to feel yourself harden again at the thought."
    ]
  ]
}