{
  "pickup": {
    "intro": [
      ["girlname0"],
      ["girltalk0"],
      ["You also see the bulge of her overfull bladder."],
      ["girltalk1",
      "girltalk2"],
      ["She seems pretty upset."],
      ["girltalk3"],
      ["girlname1"],
      ["girlname2"],
      ["girltalk4"],
      ["girlname3"]
    ],
    "girlname": [
      "You get in your car and drive over to {0}'s place.",
      "{0} whispers shyly: I've been been bursting my bladder waiting for you.",
      "{0} whispers shyly: I'm so glad you're finally here - I've <i>really</i> got to pee!",
      "You're at {0}'s place to pick her up."
    ],
    "always": [],
    "girltalk": [
      "{0}Oh! You're early! I wasn't expecting you to show up on time!",
      "{0}Where have you been?",
      "{0}You're late.",
      "{0}I know you asked me to wait, but I couldn't hold it - I <b>had</b> to pee.",
      "{0}I waited to pee just like you asked"
    ],
    "money": [],
    "choices": []
    } ,
  "theHome":{
    "choices": {
      "visit": "Go to girlname's place",
      "wantVisit": "Accept girlname's invitation to go home with her.",
      "elevator": "Go up with her.",
      "goodNight": "Say goodnight."
    },
    "arrive": [
      "You and girlname arrive at her place.",
      "It's a 3rd floor apartment in a nice complex."
    ],
    "inviteUp": "She invites you to come up for a drink.",
    "goodnight": "girltalk Good Night... See you soon?",
    "goElevator": "You take girlname by the hand and go to wait in front of the elevator.",
    "elevArriveEmer": [
      "The elevator finally appears, and girlname rushes to enter as the door opens. She suddenly steps back and stands still, trembling with the effort to conceal her desperation, as a pretty woman walks out.",
      "girlname lunges into the elevator and mashes the 3rd floor button with one hand while openly holding herself with the other."
    ],
    "elevArrive": "The elevator appears, so you step inside with girlname and hit the button for the 3rd floor.",
    "elevWait": [
      "The elevator has not yet arrived.",
      "You wait patiently with girlname."
    ],
    "elev3rdFloor": [
      "The elevator finally reaches the 3rd floor.",
      "You and girlname walk across the hall to the door of her apartment."
    ],
    "sheHasKeys": "girltalk Good thing I haven't lost my keys, huh?",
    "inElev": "You're in the elevator with girlname."
  }


}