{
  "pickup": {
    "goOver": "You get in your car and drive over to girlname's place.",
    "earlyComment": "girltalk Oh! You're early! I wasn't expecting you to show up on time!",
    "bladderBulgeDesc": [
      "You also see the bulge of her overfull bladder.",
      "You notice her stomach is swollen where her bladder is."
    ],
    "lateComment": [
      "girltalk Where have you been?!",
      "girltalk You're late!"
    ],
    "upsetDesc": [
      "She seems pretty upset.",
      "She frowns angrily at you.",
      "<b>You:</b> I'm sorry."
    ],
    "prePeed": "girltalk I know you asked me to wait, but I couldn't hold it - I <b>had</b> to pee.",
    "lateHold":[
      "girlname whispers shyly: I'm so glad you're finally here - I've <i>really</i> got to pee!"
    ],
    "arriveHold": [
      "girlname whispers shyly: I've been been bursting my bladder waiting for you."
    ],
    "askedHold": [
      "girltalk I waited to pee like you asked.",
      "girltalk I've been holding my bladder like you wanted."
    ],
    "pickupMsg": "You're at girlname's place to pick her up.",
    "choices": {
      "askToilet": "Ask if you can use her toilet.",
      "letsGo": "Say let's get going."
    }
    } ,
  "theHome": {
    "choices": {
      "visit": "Go to girlname's place",
      "wantVisit": "Accept girlname's invitation to go home with her.",
      "elevator": "Go up with her.",
      "goodNight": "Say goodnight.",
      "keySlap": "Damn...",
      "keyNvm": "Duhhh....",
      "keyGood": "Ummm.....",
      "keyBad": "Errr.....",
      "keysNotFound": "Haven't found anything yet.",
      "foundThem": "Found them!",
      "followHer": "Follow her to her bedroom.",
      "allowPee": "Tell her she should go and pee.",
      "askBathroom": "Ask if you can use her bathroom",
      "kissHer": "Kiss her on the lips"
    },
    "arrive": [
      "You and girlname arrive at her place.",
      "It's a 3rd floor apartment in a nice complex."
    ],
    "inviteUp": "She invites you to come up for a drink.",
    "goodnight": "girltalk Good Night... See you soon?",
    "goElevator": "You take girlname by the hand and go to wait in front of the elevator.",
    "elevArriveEmer": [
      "The elevator finally appears, and girlname rushes to enter as the door opens. She suddenly steps back and stands still, trembling with the effort to conceal her desperation, as a pretty woman walks out.",
      "girlname lunges into the elevator and mashes the 3rd floor button with one hand while openly holding herself with the other."
    ],
    "elevArrive": "The elevator appears, so you step inside with girlname and hit the button for the 3rd floor.",
    "elevWait": [
      "The elevator has not yet arrived.",
      "You wait patiently with girlname."
    ],
    "elevWaitQuote": [
      "girltalk It should be here any moment.",
      "girltalk I've had a really great night so far. This is the best date I've had in years!",
      "girltalk I wish I had some champagne at my flat. That would make this night <i>perfect</i>. "
    ],
    "elevWaitEmerQuote": [
      "girltalk God Dammit, why is it taking so long?!",
      "girltalk I don't know if I can wait for this.",
      "girtalk This fucking elevator is so slow!"
    ],
    "elev3rdFloor": [
      "The elevator finally reaches the 3rd floor.",
      "You and girlname walk across the hall to the door of her apartment."
    ],
    "sheHasKeys": "girltalk Good thing I haven't lost my keys, huh?",
    "inElev": "You're in the elevator with girlname.",
    "searchKeys": "girlname searches through her purse for her keys.",
    "lostKeys": "girltalk I can't find my keys!",
    "giveKeys": "Offer her her keys.",
    "lookKeys": "Offer to look for her keys.",
    "getKeys": "You pull her keys from your pocket.",
    "giveKeysDesp": "girlname grabs the keys and opens the door.",
    "giveKeysQuest": "girltalk Where'd you get those?!",
    "keysNvm": [
      "girltalk Oh, never mind. Want to come in?",
      "She opens the door."
    ],
    "keysGood": [
      "<b>You: </b> Oh, they fell out of your purse when we left the elevator and I grabbed them so you wouldn't lose them.",
      "girlname beams at you.",
      "\"Thank you! I wouldn't know what to do without you! Please, come inside with me.\""
    ],
    "keysBad": [
      "girlgasp You stole them when I was in the bathroom. <em> How could you!</em>.",
      "She raises her hand and slaps you.",
      "<em>hard</em>",
      "Your cheek throbs as she grabs the key out of your hand quickly entering her flat before slamming the door closed behind her.",
      "Leaving you outside alone."
    ],
    "offersPurse": ["girlname offers you her purse",
      "You accept the purse, palming the keys in your pocket. Before rummaging through it"
    ],
    "rummagePurse": "You palm the keys in your pocket, as you continue rummaging through her purse.",
    "atHome": "You are with girlname at her home.",
    "kissExceeded": [
      "girlname suddenly pulls away from you and sits straight up.",
      "girltalk You know, this just isn't working out.",
      "girltalk I'm afraid we're going to have to call it a night."
    ],
    "champagneLose": [
      "girlgasp I'm going ... ",
      "She waves vaguely behind her in the direction fo the hallway.",
      "girltalk Bathroom!"
    ],
    "inviteBedroom": "She invites you to come back to her bedroom."
  }


}