{
  "needlose": [
    "<i>She's bent over double and running in place, a look of panic in her eyes.</i>",
    "<i>She has her hand jammed in her crotch and her breath is coming in short gasps.</i>",
    "<i>She is frozen in place with her crossed legs straining and her face is flushed bright red.</i>",
    "<i>She is panting with each spasm and has her hand between her legs, pulling up on her crotch.</i>",
    "<i>She has both hands pressed tightly into her crotch, squeezing her breasts between her arms.</i>",
    "<i>She is rubbing her pee hole rapidly with her full hand and gasping as she fights to hold it in.</i>"],
  "sitneedlose": [
    "<i>She's bent over and can't stop squirming, a look of panic in her eyes.</i>",
    "<i>She has her hand jammed in her crotch and her breath is coming in short gasps.</i>",
    "<i>She is frozen in place with her crossed legs straining and her face is flushed bright red.</i>",
    "<i>She is panting with each spasm and has her hand between her legs, pulling up on her crotch.</i>",
    "<i>She has both hands pressed tightly into her crotch, squeezing her breasts between her arms.</i>",
    "<i>She is rubbing her crotch rapidly with her full hand and gasping as she fights to hold it in.</i>"],
  "tubneedlose": [
    "<i>She's bent over and can't stop squirming, a look of panic in her eyes.</i>",
    "<i>She has her hand jammed in her crotch and her breath is coming in short gasps.</i>",
    "<i>She is frozen in place with her crossed legs straining and her face is flushed bright red.</i>",
    "<i>She is panting with each spasm and has her hand between her legs, pulling up on her crotch.</i>",
    "<i>She has both hands pressed tightly into her crotch, squeezing her breasts between her arms.</i>",
    "<i>She is rubbing her crotch rapidly with her full hand and gasping as she fights to hold it in.</i>"],
  "needemer": [
    "<i>She is dancing from foot to foot, her hand clenched into a tight fist.</i>",
    "<i>Goosebumps suddenly form on her arm, and she reaches quickly behind her butt to give her crotch a squeeze.</i>",
    "<i>She is bent forward, a hand on her thigh, and she is wiggling her bottom back and forth.</i>",
    "<i>She is leaning to one side, her right leg raised and crossed over to put pressure on her pussy.</i>",
    "<i>Her dress has ridden up and you can see her thighs suddenly tense with effort.</i>",
    "<i>She quickly curtseys and then straightens back up, rubbing her hands over her thighs.</i>"],
  "sitneedemer": [
    "<i>She is squirming back and forth, her hand clenched into a tight fist.</i>",
    "<i>Goosebumps suddenly form on her arm, and she reaches quickly between her legs to give her crotch a squeeze.</i>",
    "<i>She is bent forward, a hand on her thigh, and she is wiggling her bottom back and forth.</i>",
    "<i>She is leaning to one side, her right leg raised and crossed over to put pressure on her pussy.</i>",
    "<i>Her dress has ridden up and you can see her thighs suddenly tense with effort.</i>",
    "<i>She quickly bends backwards, raising her ass, and then falls back down, rubbing her hands over her thighs.</i>"],
  "tubneedemer":[
    "<i>She is squirming back and forth, her hand clenched into a tight fist.</i>",
    "<i>Goosebumps suddenly form on her arm, and she reaches quickly between her legs to give her crotch a squeeze.</i>",
    "<i>She is bent forward, a hand on her thigh, and she is wiggling her bottom back and forth.</i>",
    "<i>She is leaning to one side, her right leg raised and crossed over to put pressure on her pussy.</i>",
    "<i>You can see her thighs suddenly tense with effort under the water.</i>",
    "<i>She quickly bends backwards, raising her ass, and then falls back down.</i>"],
  "need": [
    "<i>She is resting her hand on her hip and standing bent slightly forward.</i>",
    "<i>She runs her hands through her hair.</i>",
    "<i>Her hands are close by her sides, fingers slightly clenched.</i>",
    "<i>She brings her hand up to her cheek and rubs it once.</i>",
    "<i>She crosses and uncrosses her legs.</i>",
    "<i>She shifts her weight first to her right and then to her left.</i>"],
  "sitneed":[
    "<i>She is resting her hands in her lap and bent slightly forward.</i>",
    "<i>She runs her hands through her hair.</i>",
    "<i>Her hands are close by her sides, fingers slightly clenched.</i>",
    "<i>She brings her hand up to her cheek and rubs it once.</i>",
    "<i>She crosses and uncrosses her legs.</i>",
    "<i>She shifts her butt first to her right and then to her left.</i>"],
  "tubneed":[
    "<i>She is resting her hands in her lap and bent slightly forward.</i>",
    "<i>She runs her hands through her hair.</i>",
    "<i>Her hands are close by her sides, fingers slightly clenched.</i>",
    "<i>She brings her hand up to her cheek and rubs it once.</i>",
    "<i>She crosses and uncrosses her legs.</i>",
    "<i>She shifts her butt first to her right and then to her left.</i>"],
  "needurge":[
    "<i>You notice her flat, toned tummy.</i>",
    "<i>She purses her delicate red lips.</i>",
    "<i>You notice her full, firm breasts pressed against the fabric of her tight blouse.</i>",
    "<i>You notice her nails are painted a dark shade of red.</i>",
    "<i>The outline of her nipples through the thin strech blouse makes you wonder if she's really wearing a bra.</i>",
    "<i>You notice her firm, pert butt.</i>"],
  "sitneedurge":[
    "<i>You notice her flat, toned tummy.</i>",
    "<i>She purses her delicate red lips.</i>",
    "<i>You notice her full, firm breasts pressed against the fabric of her tight blouse.</i>",
    "<i>You notice her nails are painted a dark shade of red.</i>",
    "<i>The outline of her nipples through the thin stretch blouse makes you wonder if she's really wearing a bra.</i>",
    "<i>You notice her firm, pert butt.</i>"],
  "tubneedurge":[
    "<i>You notice her flat, toned tummy.</i>",
    "<i>She purses her delicate red lips.</i>",
    "<i>You notice her full, firm breasts just under the surface of the water.</i>",
    "<i>You notice her nails are painted a dark shade of red.</i>",
    "<i>You stare at her toned, naked body disappearing down into the murk of the water.</i>",
    "<i>You notice the graceful curve of her arm.</i>"],
  "embarquote": [
    "I'm so embarassed.  I just couldn't hold it in.",
    "I'm so sorry!  I just couldn't control it anymore.",
    "I'm so embarassed!  It just started to come out and I couldn't stop it.",
    "It's so embarassing.  I just couldn't control my bladder.",
    "I'm so sorry!  I couldn't hold it any longer.",
    "I'm so embarassed!  I couldn't control myself."],
  "outpeelook": [
    "No!  Don't look!",
    "Ugh!  Don't watch me!",
    "Wait!  Don't look at me.",
    "Oh No!  Please don't look!",
    "Oh No! You can't look!",
    "Please don't stare!"],
  "outpeehide": [
    "Please help me hide!",
    "Please don't let anyone watch!",
    "Can you watch out for people coming?",
    "Can you help me hide?",
    "Please don't let anyone look!",
    "Don't let anybody see me!"],
  "outpeectrl": [
    "Ungh! I can't hold it anymore!",
    "Oh God!  I can't control it!",
    "Urgh!  I can't stop it.",
    "Oh! I can't wait any more!",
    "Fuck!",
    "Dammit!"],
  "outpeecome": [
    "It's coming out.",
    "I'm starting.",
    "I'm going to start.",
    "It's coming!",
    "It's starting!",
    "I'm peeing!"],
  "deny": [
    "I'm fine, thanks for asking.",
    "No, thanks.  I'm okay.",
    "Nope - not at all.",
    "I'm alright.  It's nice of you to ask.",
    "I'm great, thanks.",
    "I'm okay, thanks for asking."
  ],
  "holdlose": [
    "I can't hold it anymore!",
    "I can't control it any longer!",
    "I can't wait any more!",
    "I'm losing control!",
    "I can't stop it!",
    "It's coming out!"
  ],
  "holdemer": [
    "I don't think I can hold it much longer.",
    "I don't know if I can control it much longer.",
    "I don't think I can last much longer.",
    "I don't know if I can control it much longer.",
    "I can't control my bladder much longer.",
    "I'm not going to be able to hold it too much longer."
  ],
  "holdneed": [
    "I think I can hold it a little longer.",
    "I can control it for just a little longer.",
    "I'll be okay for a little bit.",
    "I think I can wait just a little while.",
    "I think I'll be okay for a little bit.",
    "I'm not sure, but I can probably last a little longer."
  ],
  "holdurge": [
    "I have to go, but I can hold it.",
    "I can control myself for a while",
    "I can wait.",
    "It's not an emergency.  I can hold it.",
    "I'll be fine for a while.",
    "I'll be okay for a bit."
  ],
  "holdokay": [
    "I don't even feel the slightest need to go.",
    "I don't have to pee at all.",
    "My bladder's not even a little bit full.",
    "I don't need to pee yet.",
    "I'm prefectly fine.",
    "I don't need to go at all."
  ],
  "peestory": [
    "I used to never want to go to the restroom at school, and I'd hold it until I got home, which usually worked okay.  But one day, I was late for the bus and I didn't have a chance to pee in the morning after I got up.  I was <u>so</u> desperate all day.",
    "Once my toilet broke and I had to call the plumbers and they took <i>forever</i> to come.  I was nearly wetting myself when they did finally show up, but I didn't want to say anything.",
    "One time I got stuck in traffic on the way home from work.  I <u>really</u> had to pee, but there was nowhere to pull off.",
    "You know, I once bet my brother I could hold my pee longer than him.",
    "I really hate those porta-potties they have at fairs.  I remember one time I went to the county fair and I really had to pee, but I didn't want to leave.  I kept wandering around looking for a real restroom, getting more and more desperate.",
    "In college we used to play a game where they duct taped beers to your hands, and you had to finish the beers before you could go to the bathroom.",
    "One summer, I was working as a receptionist at an airline office, and everybody else in the office would go out for lunch, leaving me to deal with everything.  I wasn't allowed to leave my desk during lunch hour.  This was usually fine, but I had too much coffee one morning, and I was in big trouble.  I had to pee so bad!",
    "In school I got a date with this really great guy, and I was so nervous that I'd do something to mess it up, I kept drinking water at dinner in the pauses in the conversation.  By the end of dinner, I really had to pee, but I was too shy to say anything and I didn't want to make us late for the movie.",
    "I went on a boating trip with some friends on spring break.  We all dressed up in our bikinis, drank a bunch of beer, and teased the guys on the river.  Nobody told us the boat didn't have a restroom.  We all had to pee <i>so</i> badly, but we were trying to act all cool about it."
  ],
  "peestory2": [
    "I almost made it.  I was walking back home and I just couldn't hold it anymore - I always thought I could just try a little harder and hold it in, but it just started coming out.  There was nothing I could do.  I soaked my panties right outside my front door.",
    "I tried so hard to hold it without them noticing.  But after a while, I just couldn't control myself - I ended up going out into the backyard away from the plumbers and peeing in a cup.",
    "I saw all these people pulling off to the side of the road and peeing on the ground behind their cars.  I was about to do the same thing, but then the traffic jam eased up and I made it home.  I might have leaked a little bit into my panties, though.  It was <i>so</i> hard to from the car to the bathroom without peeing myself.",
    "I won.  He finally gave up and pulled out his dick and let go - but then I couldn't get my panties down before I started peeing.  I ended up wetting myself right in front of him - with my panties only halfway down.",
    "I ended up almost wetting myself - I just <u>had</u> to go.  It got so bad I couldn't walk and hold myself at the same time, so I finally went in one of the portapotties.  It was sooo gross.",
    "It was <b>so</b> embarassing.  I finished the beers, but I peed myself right in front of everybody while they were taking the duct tape off.  Never played that game again.",
    "I kept waiting and waiting for the rest of the crew to come back from lunch, but they were late that day.  And I started thinking I could use the trash can or something, but then when I made it to 1pm and they hadn't come back yet, I started worrying that if I did have to use the trashcan, they'd come back and find me peeing.  But it got so bad I simply had to try it.  I went over to bring the trash can behind my desk, and then everybody came back from lunch.  I nearly lost it completely ... definitely spurted in my panties.",
    "We went to see the movie, and I just couldn't sit still.  I didn't know what to do.  I felt it almost coming out, but I was trapped in the row of seats.  Luckily, it was dark, so I hiked up the back of my dress and let it out slowly into the cushion.  It was so embarassing, but nobody ever found out.",
    "Well - finally my friend couldn't hold it anymore, and jumped in the water to pee.  We all ended up peeing in our bikinis in the river."
  ],
  "askpee": [
    "<b>YOU:</b> Do you need to pee?",
    "girlname5",
    "girltalk33",
    "She seems to be considering the matter..."
  ],
  "preventpee": [
    ["nopeesolodrink", "Suggest that she have another drink instead."],
    ["holdit", "Ask her to hold it in."],
    ["ptogether", "Ask her not to leave you alone."],
    ["pgirlsroom", "Tell her it would be sexy if you could watch."],
    ["pnorestroom", "Tell her she can go, but not in the restrooms."],
    ["pdrinkinggame", "Tell her she can go, but afterwards you should play a drinking game."],
    ["pphotogame", "Tell her she can go, but you want to take a couple pictures first."],
    ["nextstop", "Tell her you'll stop the next place you see."],
    ["allowpee", "Tell her she's better go, then."],
    ["indepee", "Ignore her request to use the toilet."]
  ],
  "askcanhold": [
    "<b>YOU:</b> How are you doing?  Can you still hold it?"
  ],
  "pstory": [
    "<b>You:</b> have you ever waited too long?",
    "<b>You:</b> so... did you make it?",
    "girlname6"
  ],
  "girlname": [
    "Remind {0} you're paying her to hold it.",
    "Tell {0} you'll pay her to hold it.",
    "The pee hisses out and the glass is filled in no time. {0} bends over and jams her hand between her legs, gasping in the effort to stop the flow.",
    "{0} puts herself back together, looking embarrassed.",
    "The stream slows and finishes, and {0} lets out a sigh of relief.",
    "{0} blushes.",
    "{0} blushes and looks down at her feet.",
    "{0} suddenly and frantically looks around.  She fumbles with her seat belt, then the wrenches open the door and jumps out of the car.",
    "{0} suddenly stiffens and whispers: Oh no!",
    "{0} suddenly and frantically looks around, pulling open the glove box and feeling under her chair.",
    "{0} hands you the wet panties, soaked with her fragrant urine."
  ],
  "holdit": {
    "dialogue": [
      "girltalk0",
      "girltalk1",
      "girlgasp0",
      "girltalk2",
      "girltalk4",
      "She's hung up on you.",
      "girltalk3"
  ],
    "girlgasp": [
    "{0} I can't hold it - it's - it's coming out!"
  ],
    "girltalk": [
      "{0} I don't know...",
      "{0} Ummm...  Oh.   Oh.  Uh. ohmygod.  ohmygod. ohmygod.",
      "{0} I'm so embarassed - I'll go clean up.",
      "{0} Not gonna happen, bub.",
      "{0} Sorry"
    ]}
  ,
  "askhold": [
    "<b>YOU:</b> But we're having so much fun - can't you wait a little bit?",
    "<b>YOU:</b> It would be nice if you could wait just a little longer.",
    "<b>YOU:</b> Can you try to hold on just a little bit longer - I know where there's a really great bathroom.",
    "<b>YOU:</b> Would you wait just a bit?  For me?",
    "<b>YOU:</b> I bet you can hold it for a bit longer - we're having so much fun!",
    "<b>YOU:</b> Why now?  I'm sure you can wait just a bit."
  ],
  "surpriseexcl": [
    "You've gotta be kidding!",
    "Oh come on!",
    "What??!?",
    "Whaddaya mean??!?",
    "No way!?  Really?",
    "You're joking, right?"
  ],
  "drankburst": [
    "without peeing once!",
    "and they're bursting my bladder!",
    "and I've really got to go!",
    "and my bladder's not that big!",
    "and I haven't gone to the bathroom yet!",
    "and I'm not a camel!"
  ],
  "holdingtime": [
    "I've been holding it for",
    "I've haven't gone for",
    "I've had to pee for",
    "I've already lasted",
    "My bladder's been filling for",
    "I've been waiting for"
  ],
  "convinceher": [
    ["briberoses", "Try to bribe her with roses."],
    ["bribeearrings", "Try to bribe her with earrings."],
    ["bribefavor", "Call in a favor"],
    ["bribeask", "Ask her nicely"],
    ["indepee", "Just let her go..."]
  ],
  "holdquip": {
    "lose":[
      "I've never in my life had to go so bad, but I'll try to hold it for you.",
      "I <i>can't</i> wait - but I'm trying as hard as I can.",
      "I'm trying to control it.  I'm trying to control...",
      "I can feel it coming out, but I'm holding as hard as I can.",
      "God! Don't pee!  Don't pee! Don't pee!",
      "It's pulsing! Gotta hold!  Gotta hold!"
    ],
    "emer": [
      "I'm desperate here, but I'll try to hold on.",
      "I'll try to wait, but I <b><i>really</i></b> need to go.",
      "I don't know how much longer I can wait, but I'm trying.",
      "I don't think I can hold it much longer, but I'm trying.",
      "I don't think I've had to go this bad in a long time, but I'm gonna hold it.",
      "I'll try to control my bladder for you."
    ],
    "need": [
      "I've gotta go soon, but I'll wait.",
      "I can wait a little bit ... I guess.",
      "I'm awfully full, but I can hold it.",
      "I don't want to explode my bladder, but I'll wait.",
      "I can hold it... I think.",
      "I need to go, but I've held it longer than this before."
    ],
    "urge": [
      "I don't have to go very bad yet.  I can wait.",
      "I don't really need to pee that bad yet.",
      "I'm fine.  I can hold it.",
      "I've held it longer lots of times.",
      "I don't need the little girls room yet - I can wait.",
      "No problem.  I'll hold it."
    ],
    "noneed": [
      "I'm a big girl now - I can handle it."
    ]
  },
  "begtoilet": {
    "dialogue": [
      "girlname0",
      "I've absolutely got to go.  I <i>need</i> your vase again. <b>NOW!</b>",
      "I'm gonna pee myself!  I <i>need</i> that shot glass again. <b>NOW!</b>",
      "I just <b>can't</b> hold it - you don't have any more paper towels, do you?",
      "I'm <i>begging</i> you - find me somewhere to pee.  <b>NOW!</b>"
    ],
    "girlname": [
      "{0} looks intently into your eyes:"
    ],
    "choices": [
      ["peeshot", "Offer her the shot glass."],
      ["peetowels", "Offer her the roll of paper towels."],
      ["peevase", "Offer her the vase."],
      ["peeoutside", "Suggest she pee outside."],
      ["curloc", "Stand by helplessly."]
    ]
  },
  "briberoses": [
    "<b>YOU:</b> Pretty please!  I'll give you roses",
    "girltalk0"
  ],
  "bribeask": [
    "<b>YOU:</b> Pretty please!"
  ],
  "bribefavor": [
    "<b>YOU:</b> Pretty please!  Remember you promised to do me a favor!",
    "girltalk1"
  ],
  "interplose": [
    "She looks like she's losing control.",
    "She looks like she's going to blow any second.",
    "She looks like she's seconds away from peeing herself.",
    "She looks like she can't maintain bladder control any longer.",
    "She looks like she's going to pee any second.",
    "She looks like she can't hold it a second longer."
  ],
  "interpemer": [
    "She looks like she's nearly wetting herself.",
    "She looks like she's about to lose bladder control.",
    "She looks super desperate to pee.",
    "She looks like she can't stand to wait very much longer to pee.",
    "She looks like she could lose control of her bladder any minute.",
    "She looks absolutely desperate for the toilet."
  ],
  "interpneed":[
    "She looks uncomfortable - like she has to pee badly.",
    "She looks like she's trying to ignore a full bladder.",
    "She's acting like her bladder is uncomfortably full.",
    "She seems to be controlling her bladder.",
    "She seems distracted by the pressure in her bladder.",
    "She's looks like she might need to pee."
  ],
  "sheholds": [
    "She needs to pee badly, but she's holding it for you.",
    "Her bladder is bursting but she's controlling it because you asked her.",
    "She's desperate to pee, but she's holding it just a little longer at your request.",
    "Her bladder is terribly full, but she's holding it in to please you.",
    "She's holding her pee in just for you, and she really needs to go.",
    "She wants very much to pee, but she's holding it in like you asked."
  ],
  "payholdit": [
    "<b>YOU:</b> I'll pay you if you can hold it for a while.",
    "girltalk3"
  ],
  "payfails": [
    "girltalk2"
  ],
  "bribeearrings": [
    "<b>YOU:</b>  Pretty please!  I'll give you a set of diamond earrings if you can hold it!",
    "girltalk4"
  ],
  "girltalk": [
    "{0} Okay. For roses.",
    "{0} Well... Okay.  But just a little bit.  I did promise you a favor.",
    "{0} That's not going to be enough.",
    "{0} I don't know... how much?",
    "{0} For diamonds, I'd do much more than hold it.  But okay.",
    "{0} Thanks! I do really have to go. You're so sweet.",
    "{0} Can you hold my purse for me?",
    "{0} Great!",
    "{0} You're a naugthy boy, aren't you?",
    "{0} But I'm going to wet my panties if I don't go.....",
    "{0} God! I can't wait any longer!",
    "{0} I think maybe not. At least not yet.",
    "{0} Somehow, I don't think that's happening.",
    "{0} Damn. That's not much better.",
    "{0} That's pretty kinky!",
    "{0} But I'm about to wet my panties",
    "{0} I just can't hold it anymore. Give it here",
    "{0} But a vase? I can't! At least not yet",
    "{0} That's kind of gross!",
    "{0} But in just a roll of towels? No way! At least not yet.",
    "{0} Sure you're okay with it?",
    "{0} I'll just wait, thank you very much.",
    "{0} That feels <i>so</i> much better.",
    "{0} I'm so embarrassed to have to pee outside again.",
    "{0} That's pretty daring. I've never gone outside before.",
    "{0} I can't hold it! What am I gonna do???",
    "{0} But I can't just go outside!",
    "{0} At least not yet.",
    "{0} Pee outside? No way am I exposing my privates to the whole world!",
    "{0} Are you sure it's safe?",
    "{0} Oh! that is so much better. I thought I was going to lose it there for a second.",
    "{0} That's so much better.",
    "{0} That's <b>so</b> much better. I was dying!",
    "{0} ...",
    "{0} Hey! Keep your hands to yourself!",
    "{0} Oh No!  Your seat!",
    "{0} I'm <u>so</u> sorry about your car...",
    "{0} Is there someplace you can put these?",
    "{0} Good thing I wasn't wearing panties, I guess.",
    "{0} I'm <u>so</u> sorry ... I just couldn't hold it.",
    "{0} I peed in the tub.",
    "{0} Why would I do that!? I don't have to go!",
    "{0} Ooh kinky, you really want me to do that?",
    "{0} Well, I don't exactly have to go, but if it would make you happy I can try.",
    "{0} I don't know about that. Maybe later.",
    "{0} Oh! You're getting off on this aren't you?",
    "{0} Well good thing you're cute and I do have to go.",
    "{0} Oh, you filthy boy!",
    "{0} I need to go really bad though",
    "{0} I'm absolutely bursting. Give it here!",
    "{0} You think this is funny?! There is absolutely no way in hell I'm going to piss into that!",
    "{0} Ugh! that did almost nothing!",
    "{0} There, was that what you wanted?",
    "{0} Oh, you think this is hot don't ya? You bad bad boy.",
    "{0} Okay. For you. I do have to go after all.",
    "{0} Now that was interesting. We should do that again later."
  ],
  "girlgasp": [
    "{0} Ungh!  I can't hold it."
  ],
  "allowpee": [
    "<b>YOU:</b> Well, if you have to pee that bad, I guess you can go.",
    "girltalk5",
    "girltalk6"
  ],
  "holdpurse": [
    "girltalk7",
    "She hands you her small, stylish purse and runs off to relieve herself.",
    "You open the top and see:",
    "Thinking they might come in handy later, you pocket {0}."
  ],
  "peeshot": [
    "girltalk8",
    "girltalk9",
    "girltalk10",
    "girltalk11",
    "girltalk12",
    "She runs to the bathroom with your shot glass in hand.",
    "You are left to ponder your situation.",
    "girlname2",
    "girltalk13"
  ],
  "vase": [
    ["girltalk41"],
    ["girltalk42",
     "girltalk43",
     "She accepts the vase from you."],
    ["She frowns at the vase.",
     "girltalk17"
     ],
    ["girltalk53",
     "<b>YOU: </b> I think you're very hot, and I would really like it if you did this for me.",
     "You reach up slowly to stroke her face.",
     "<b>YOU: </b> please?",
     "girltalk54"
    ],
    ["girltalk14",
    "girltalk15"],
    ["girltalk16",
    "She grabs the vase, wrenching it from your hands and nearly dropping it."],
    ["girltalk12"],
    ["The pee hisses out for nearly a minute, the vase is filled almost to the top.",
    "girlname3"],
    ["You see a stream of pee coming from her pussy.",
     "It isn't very strong, it is obvious she wasn't all that full.",
     "She did it just to please you!",
     "She smirks as she makes herself decent again. Causing you to twitch in your pants.",
     "girltalk55",
      "<b>YOU:</b> Oh, I'm sure that can be arranged."
     ]
  ],
  "peetowels": [
    "girltalk18",
    "girltalk14",
    "girltalk15",
    "She takes the roll of paper towels in both hands and freezes for a moment, thinking.",
    "girltalk19",
    "girltalk11",
    "She runs off with your roll of paper towels in hand.",
    "You are left to ponder your situation.",
    "The pee hisses out and is mostly absorbed by the paper towels, just a small trickle running down her left leg.",
    "She carefully sets to sopping wet roll of towels in a corner."
  ],
  "champ-glass": [
    ["girltalk41"],
    ["girltalk42",
     "girltalk43",
      "She accepts the champagne glass from you."
    ],
    ["She shifts uncomfortably",
     "girltalk44"],
    ["girltalk45",
     "You shrug slightly. She glances down, probably noticing your erection, which you couldn't suppress at the idea of her pissing into the glass.",
     "girltalk46",
     "She smiles seductively at you as she moves a bit closer, slowly grabbing the glass"],
    [ "girltalk47",
      "girltalk48"
    ],
    [ "girltalk49",
     "She rips the glass out of your hand, so hard you almost fear it will break."],
    [ "She raises an eyebrow",
      "girltalk50"
    ],
    [ "The urine hisses out of her pussy. Quickly filling the glass. She groans, muscles shaking as she obviously tries to stem the flow.",
      "girltalk51"
    ],
    ["She sighs slightly as a small controlled stream leaves her.",
      "The stream stops, you can see that the glass is not fully filled. She mustn't have been very full",
      "Arousal clouds your vision as you realise she did that, just for you.",
      "She smiles slightly at you as she fixes her clothes. Making your heart beat even quicker",
      "girltalk52",
      "<b>YOU:</b> Oh yes! That was so hot."],
    [ "She sighs slightly as a small controlled stream leaves her.",
      "As the glass fills she tenses her muscles slightly to stop the flow.",
      "She smiles slightly at you as she fixes her clothes. Making your heart beat quicker",
      "girltalk52",
      "<b>YOU:</b> Oh yes! That was so hot"]

  ],
  "peeintub": [
    "girltalk20",
    "girltalk21",
    "girlgasp0",
    "You nonchalantly move closer and slip your hand under her butt.  The strong stream of pee flows out between your fingers for nearly a minute, and you can detect the barest scent of urine rising from the hot water.  It feels strangely cool in the warm water of the tub.",
    "girlname4",
    "girltalk22"
  ],
  "peeoutside": [
    "girltalk23",
    "girltalk24",
    "girltalk9",
    "girltalk25",
    "girltalk26",
    "girltalk27",
    "girltalk28",
    "girltalk29",
    "You try to be nonchalant as you stare, and she doesn't seem to notice.  The pee hisses out from between her smooth thighs for nearly a minute, and runs in a stream under the car.  You can smell her scent as steam rises from the hot river.",
    "girltalk30",
    "She smiles at you as she gets back up and climbs back into the car.",
    "You nonchalantly move closer and watch as the pee hisses out from between her delicate pussy lips for nearly a minute, and runs in a stream along the ground.  You can smell her scent as steam rises from the hot river and she sighs in relief.",
    "girltalk31",
    "She seems aroused as she gets back up.",
    "You nonchalantly move closer and watch as the pee hisses out from between her delicate pussy lips for nearly a minute, soaking quickly into the sand and turning it dark.  You can smell her scent and hear the hiss of the urine hitting the sand and she sighs orgasimcally.",
    "girltalk32",
    "She seems aroused as she gets back up."
  ],
  "wetquote" : [
    "Suddenly, {0} squeals and then gasps!",
    "Suddenly, {0} freezes in place and her face turns bright red.",
    "{0} gasps and grabs at her pussy.",
    "{0} squeals and doubles over.",
    "{0} suddenly gasps and her face turns red.",
    "{0} suddenly shudders and her face turns red."
  ],
  "wetherself": [
    "You hear the loud hissing as her bladder uncontrollably empties itself.",
    "girlname7",
    "girlname8",
    "She sighs and slumps back in the tub, lost in her own little world for a minute or so.",
    "There's complete silence aside from her heavy breathing and some crickets in the distance.",
    "girlname9",
    "girltalk35",
    "She arches her back, lifting her ass off the chair and straining against her seatbelt.",
    "You hear the loud hissing as her bladder uncontrollably empties itself.",
    "girltalk36",
    "She settles unhappily into the squishy wet seat.",
    "girlname10",
    "girltalk37",
    "girltalk38",
    "girltalk39",
    "The faint scent of her urine rises from the water.",
    "girltalk40"
  ],
  "spurtquote": [
    "She seems a little embarassed.",
    "She seems quieter than usual.",
    "She doesn't seem to be able to look you in the eyes.",
    "She reaches towards her butt.",
    "She seems nervous.",
    "She looks like she's embarrassed about something."
  ],
  "askspurted": [
    "<b>YOU:</b> Did you just pee yourself?",
    "<b>YOU:</b> I'm not sure I believe you.",
    "You run your hand up her leg, but she pushes you away:",
    "girltalk34",
    "You run your hand up her thigh until you feel the lips of her bare pussy.",
    "There are drops of some liquid up there.",
    "You run your hand up her thigh until you feel the thin fabric of her panties.",
    "They aren't sopping wet, but the gusset has a definite wet spot.",
    "You sniff your damp fingers."
  ],
  "spurtdenyquote": [
    "Of course not!  I'm not a 3 year old.",
    "I think I'm still dry.",
    "No, I don't think so.",
    "Not really.",
    "I'm all dry.",
    "Nope.  Still in control."
  ],
  "feelthigh": [
    "You feel her thigh muscles contracting and relaxing as she tries to hold back her pee.",
    "You feel her tensing and relaxing her thighs as she fights the urge to urinate.",
    "You feel goosebumps suddenly form on her sweaty skin as a spasm sends shivers up her leg.",
    "You feel her exhausted sphincters spasming under your fingers.",
    "You feel her thighs trembling with the effort to control her bladder.",
    "Her hot, damp thighs feel slippery and they tremble with the effort of controlling her urge to pee."
  ],
  "smellpee": [
    "They smell of sex ... and her sweet urine.",
    "They smell musky, with the clean scent of fresh pee.",
    "They smell strongly of her urine.",
    "They are sticky with the scent of her sex, and her pee.",
    "They are coated with the scent of her pee.",
    "The smell reminds you of a toilet filled with golden urine, just before it's flushed."
  ],
  "scoldher": [
    "<b>YOU:</b> You're such a baby, wetting yourself like that!",
    "She pouts and turns away from you.",
    "Her face turns bright red and she begins to cry."
  ],
  "drinkquote": [
    "{0} I've <b>really</b> got to go to the bathroom, but I'll drink it if that's what you want me to do.",
    "{0} I've <b>really</b> got to pee, but I'll drink it if that's what you want me to do.",
    "{0} I've <b>really</b> got to go powder my nose, but I'll drink it if that's what you want me to do.",
    "{0} My bladder's bursting, but I'll drink it for you."

  ],
  "choices": [
    ["curloc", "Continue..."],
    ["indepee", "Continue..."],
    ["payfails", "$10.00"],
    ["payfails", "$20.00"],
    ["payokay", "$50.00"],
    ["holdpurse", "Sure, I'll take care of it!"],
    ["lookinsidepurse", "Look inside her purse."],
    ["indepee", "Be a gentleman"],
    ["indepee", "Close the purse"],
    ["lookinsidepurse", "Examine her purse again"],
    ["peeshot2", "Continue..."],
    ["peeshot3", "Continue..."],
    ["peevase2", "Continue..."],
    ["peevase3", "Continue..."],
    ["peetowels2", "Continue..."],
    ["peetowels3", "Continue..."],
    ["peeintub2", "Continue..."],
    ["peeoutside2", "Continue..."],
    ["peeoutside2b", "Continue..."],
    ["peeoutisde3", "Continue..."],
    ["peeoutside3c", "Continue..."],
    ["peeoutside3b", "Continue..."],
    ["pstory", "Ask her if she's ever wet herself."],
    ["pstory2", "Ask her what happened."],
    ["wetherself2c", "Continue ..."],
    ["wetherself2m", "Continue ..."],
    ["wetherself2t", "Continue ..."],
    ["wetherself2", "Continue ..."],
    ["askspurted", "Ask her if she peed herself."],
    ["checkspurted", "Check if she's wet."],
    ["smellspurted", "Smell your fingers."],
    ["comforther", "Apologize and comfort her"],
    ["wetherself3", "Continue ..."],
    ["wetherself3t", "Continue ..."],
    ["wetherself3c", "Continue ..."],
    ["scoldher", "Scold her for wetting herself"]
  ]
}