{
  "thehome": [
    "girlname0",
    "You hear a quick clatter and a gasp as she lifts the toilet lid.  She starts to pee violently, a loud hiss accompanying the splash of the urine in the bowl.  You imagine being in there with her as she relieves her bladder.",
    "You hear a quick clatter of the toilet lid, and then the hissing and splashing of her urine in the bowl."
  ],
  "peephone": [[
    "girltalk0",
    "girltalk1",
    "There's a bunch of clanking on the other end, quick footsteps, and a door closes.  You hear the toilet seat being lifted up, and the rustle of clothing.",
    "girltalk2",
    "The hisssssssss of a huge pee fills your receiver for nearly a minute before you hear a couple of last squirts and the wiping of toilet paper against pussy lips.",
    "girltalk3"
  ],
    [
      "girltalk4"
    ],
    [
      "girltalk5"
    ]],
  "noneavailable": [
    "girlname1",
    "There is no restroom out here in the boonies.",
    "There is no restroom in the car.",
    "There is no restroom around."
  ],
  "remaining": [
    "girlname2"
  ],
  "locked": {
    "urgency": [
      "She quickly runs back looking shaken.",
      "Momentarily, she returns looking uncomfortable.",
      "She returns looking unfulfilled."
    ],
    "cbar": [
      "girltalk0",
      "girltalk1",
      "girltalk2",
      "girltalk3"
    ],
    "cclub": [
      "girltalk4",
      "girltalk5",
      "girltalk6",
      "girltalk7"
    ],
    "girltalk": [
      "{0} It's <b><i>still</i></b> fucking locked!",
      "{0} It's <b><i>still</i></b> locked!  What's taking so long?",
      "{0} It's still locked!",
      "{0} It was locked!",
      "{0} The line's still really fucking long.",
      "{0} I think the line's getting longer...",
      "{0} The line's still really really long.",
      "{0} There was a huge line."
    ]
  },
  "barpeeprivate": [
    "You can imagine her panic in the bathroom as she sees the toilet and feels it starting to come out before she even has a chance to pull aside her short shorts",
    "You visualize her grabbing her crotch through her short shorts the moment she sees the toilet and struggling to control it long enough to peel them off",
    "You can imagine her finally relaxing over the toilet, pee pouring from her crotch for nearly a full minute.",
    "You can imagine her in front of the toilet, too desperate to even close the door before emptying her overfilled bladder",
    "You can only guess at her frenzied antics in front of the toilet as her struggling pee hole is finally allowed to relax and her full bladder empties into the toilet.",
    "You imagine her struggles to control herself just long enough to get her clothing out of the way before she empties her overtaxed bladder into the toilet."
  ],
  "barpeeprivate2": [
    "You are left to imagine the her finding a stall, carefully closing the door and peeling down her short shorts to use the toilet in private.",
    "You are left alone with only your imagination of her releasing her pent up pee into the toilet.",
    "You can only speculate what she's doing in there - Is there a line?  Does she consider the sink?  The floor drain?",
    "You can only fantasize about her final relief on the toilet - the pee pouring from her naked crotch",
    "You can just imagine the relief she feels as she pees in the privacy of the toilet.",
    "You can barely suppress the impulse to hold on to her - to follow her to the toilet where she quickly sits and empties her bladder."
  ],
  "pgirlsroom": [
    [ "<b>You: </b> Can I watch? It would be <i>so</i> sexy!"],
    [ "girltalk Really? Well.... okay. I guess there's nobody around.",
      "She grabs you by the hand and heads for the ladies room."
    ],
    [ "girltalk I don't think so, buddy."],
    [ "She confidently stalks into the deserted room, pulling you into one of the stalls."],
    [ "The sight of the toilet seems to have increased her urgency."]
  ],
  "ptogether": [
    [ "<b>You: </b> Don't go and leave me alone!"],
    [ "girltalk Really? You want to come with me?",
      "She grabs you by the hand and heads for the back of the club."
    ],
    [ "girltalk You're a big boy. You can take care of yourself."],
    [ "girlname leads you back to the restrooms."],
    [ "She looks right, looks left, and peeks in the door before quickly pulling you into a very cramped stall."],
    [ "The sight of the toilet seems to have increased her urgency."],
    [ "There's a long line for the women's restrooms. You notice they're mostly young, dressed to the nines, and in various stages of urinary urgency.",
      "Your daydreams are quickly interrupted.",
      "girlname squeezes your hand: \"I can't hold it! What are we gonna do?\""
    ],
    [ "You try not to stare too much as the torrent cascades from between her thighs.",
      "You hear the violent hissing and splashing of her pee, and the scent fills the tiny cubicle.",
      "In your life, you've never wanted to touch someone so badly."
    ],
    [ "You caress her, running your hand down her back and along the line of her butt crack.",
      "Her cheeks are warm and soft, and as your fingers reach the edge of her pussy lips, you feel small droples from the urine stream wetting your hand.",
      "Carefully, you put one finger into the edge of the stream and enjoy the sensation."
    ],
    [ "You lay your head in her lap, the warmth of her thighs on your cheek.",
      "The hissing is louder down here, and you feel stray droplets landing on your upper lips.",
      "You can sense the heat from the stream, and the smell of her is overpowering."
    ],
    [ "As the torrent subsides, you offer her some toilet paper.",
      "girltalk Thanks - I've never had to go so bad in my life!",
      "<i>She seems relaxed, radiant ... and aroused.</i>"
    ],
    [
      "<b>You:</b> Quick! In here!",
      "You pull her across the hall towards the men's room.",
      "girltalk But I can't go in there!"
    ],
    [ "She follows you into the men's room, and you carefully avoid any eye contact with the two dudes using the urinals."],
    [ "You find a reasonably clean stall and pull her in with you."],
    [ "<b>You:</b> Quick! In here!",
      "You pull her towards the back door at the end of the hall.",
      "girltalk Where are we going?",
      "<b>You:</b> I know a place!"
    ],
    [ "You emerge together into a poorly lit parking lot."],
    [ "<b>You:</b> You can go behind that dumpster over there!",
      "girltalk <i>This</i> is your solution!?"
    ],
    [
      "You can see the struggle in her eyes as she makes up her mind what to do.",
      "girltalk Can you hold me so I don't fall over?"
    ],
    [ "You quickly compose yourselves and guiltily sneak back out of the ladies room, but first..."],
    [ "You quickly compose yourselves and guiltily sneak back out of the mens room, ignoring the guys are current using the urinals. But first..."],
    [
      "You don't have to be asked twice.",
      "You take her hand and lead her behind the dumpster.  She seems nervous."
    ],
    [
      "You steady her and the stream starts immediately, first as an incoherent spray which slightly wets her shoes, and quickly building into a powerful stream.",
      "By the time she finally cuts it off, the pee has pooled into a pond which is seeping under the dumpster."
    ],
    [
      "<b>You: </b> Here! I'll help you.",
      "You push her up against the wall, in the shadows a little ways from the door.",
      "girltalk I can't..."
    ],
    [
      "Her pussy is warm and pulsing underneath the thin fabric as she struggles to control her bladder.",
      "You pull the gusset aside and spread her lips with your fingers."
    ],
    [
      "Her pussy is warm and pulsing against your hand as she struggles to control her bladder.",
      "You carefully spread her lips between your fingers."
    ],
    [
      "<b> You: </b> Go. Let it all out.",
      "She protests, but not too strongly, and you feel her pussy tense just as the flow starts, running between your fingers and slightly wetting them before spattering onto the ground in front."
    ]

  ],
  "girlname": [
    "{0} heads for the bathroom, leaving the door, leaving the door slightly ajar.",
    "{0} heads for the restroom and then realizes:",
    "{0} runs towards the restroom."
  ],
  "girltalk": [
    "{0}You're a naughty boy, aren't you?",
    "{0}But I'm about to wet my panties if I don't go, so you can come too - but no peeking.",
    "{0}Are you ready?  Want me to put the phone down there so you can hear?  Oh!  It's coming!",
    "{0}Damn.  That's soooo much better.",
    "{0}Oooooo....  that's pretty kinky.  But I think I can hold it until I'm off the phone.",
    "{0}Somehow, I don't think that's happening.  Bye now."
  ]

}