 {
  "burst": [
    "Your bladder feels like it's about to burst.",
    "You really can't hold on any more"],
  "desperate": [
   "You feel pretty desperate to pee now.",
    "You struggle to hold on to your bladder"
  ],
  "need": [
    "You feel like you could use a good pee, but nothing urgent.",
    "You're definitely aware of your bladder"
  ],
  "urge": [
    "You feel the barest sensation of a filling bladder",
    "You're starting to feel your bladder",
    "You're barely aware of your bladder"
  ],
  "empty": [
    "Your bladder feels fine.",
    "You don't feel any need to pee whatsoever"
  ],
   "wetquote": [
     "Suddenly, you are overwhelmed by your bladder, you groan and then gasp!",
     "Suddenly, you are overwhelmed by your overfilled bladder, you freeze in place and you can feel your face turning red",
     "You feel your pee coming out, you gasp and grab your dick.",
     "You lose control of your muscles, you groan and double over.",
     "Suddenly. You lose control of your bladder, you gasp and you can feel your face turning red.",
     "Suddenly the control on your sphincter slips, you shudder and you can feel your face turning red."
   ],
   "shotglass": [
     ["<b>You:</b> I got a shot glass, would you like me to pee into this?",
     "<b>You:</b> I need to pee, I got this shot glass I can pee into this.",
     "<b>You:</b> Pff, I'm bursting for a piss. I gotta go in this shot glass."],
     [ "<b>YOU:</b> Here! Please hold this for a minute.",
       "You shove the glass in her hands so you can open your fly with the hand that is not holding the steering wheel."
       ],
     ["You grab yourself through your trousers, trying to hold it back.",
       "<b>YOU:</b> Here! Please hold this for a minute.",
       "You shove the shot glass into her hands so you can use both hands to open your fly"
     ],
     [[
       "You slowly unzip your trousers, putting up quite a show",
       "Pulling your dick out, you give yourself a few strokes. "
     ],
     [ "When you're sure she's watching, you unzip your jeans.",
      "Sighing slightly you pull yourself free from your pants."],
       ["You quickly whip your dick out, not really caring that she can see it."]
     ],
     [
       "You urgently reach your hand to her.",
       "<b>You:</b> Give me the glass, it's coming out!",
       "girlname quickly hands you the glass.",
       "You push it in place before allowing your muscles to relax."
     ],
     ["You calmly position your dick in place before relaxing your muscles"],
     [
       ["A small stream of pee hisses out, you sigh slightly as the glass fills before cutting off your stream",
        "A small stream of pee hisses out, your bladder empties before the glass is full."],
       ["A decent stream shoots from your cock into the glass. You grab yourself slightly to stop the flow as the glass fills",
        "A decent stream shoots from your cock into the glass, yet you fail to fill the whole glass."],
       ["The pee hisses out and the glass is filled in no time. You groan at the effort it takes to stop the flow, you can't grasp yourself as both your hand are occupied.",
        "The pee hisses out and the glass is filled in no time. You grab your dick as you force to flow to stop. It is hard but you manage with a groan."]]
   ],
   "vase": [
     ["<b>You:</b> I got a vase, wouldn't it be sexy if I peed into this?",
       "<b>You:</b> I need to pee. Thankfully I got this vase, I can pee into this.",
       "<b>You:</b> Pff, I'm bursting for a piss. I can't hold it, I gotta go in this vase."],
     [ "<b>You:</b> Here! Please hold this for a minute.",
       "You almost throw the vase in her lap so you can open your fly with the hand that is not holding the steering wheel."
     ],
     ["You grab yourself through your trousers, trying to contain the pulsing.",
       "<b>You:</b> Here! Please hold this for a minute.",
       "You almost throw the vase at her so you can use both hands to open your fly"
     ],
     [[
       "You slowly unzip your trousers, making it entertaining for her if she wanted to watch.",
       "Pulling your dick out, you give yourself a few strokes. "
     ],
       [ "When you're sure she's watching, you unzip your jeans.",
         "Sighing slightly you pull your cock free from your pants."],
       ["You quickly whip your dick out, not really caring that she can see it."]
     ],
     [
       "You reach out to girlname.",
       "<b>You:</b> I can't hold it! Quick give me the vase!",
       "girlname gives you the vase.",
       "You quickly put it between your legs before releasing your bladder."
     ],
     ["You calmly position your dick in place before relaxing your muscles"],
     [
       ["A small stream of pee hisses out, it stops quickly as you didn't really have to go."],
       ["A decent stream shoots from your cock, hitting the glass of the vase, you sigh slightly enjoying the relief."],
       ["The pee hisses out for nearly a minute and the vase is almost filled to the to the top",
         "<b>You:</b> Oh! That's much better."
       ]]
   ],
   "champ-glass": [
     ["<b>You:</b> I got a shot glass, would you like me to pee into this?",
       "<b>You:</b> I need to pee, I got this shot glass I can pee into this.",
       "<b>You:</b> Pff, I'm bursting for a piss. I gotta go in this shot glass."],
     [ "<b>YOU:</b> Here! Please hold this for a minute.",
       "You shove the glass in her hands so you can open your fly with the hand that is not holding the steering wheel."
     ],
     ["You grab yourself through your trousers, trying to hold it back.",
       "<b>YOU:</b> Here! Please hold this for a minute.",
       "You shove the shot glass into her hands so you can use both hands to open your fly"
     ],
     [[
       "You slowly unzip your trousers, putting up quite a show",
       "Pulling your dick out, you give yourself a few strokes. "
     ],
       [ "When you're sure she's watching, you unzip your jeans.",
         "Sighing slightly you pull yourself free from your pants."],
       ["You quickly whip your dick out, not really caring that she can see it."]
     ],
     [
       "You urgently reach your hand to her.",
       "<b>You:</b> Give me the glass, it's coming out!",
       "girlname0",
       "You push it in place before allowing your muscles to relax."
     ],
     ["You calmly position your dick in place before relaxing your muscles"],
     [
       ["A small stream of pee hisses out, you sigh slightly as the glass fills before cutting off your stream",
         "A small stream of pee hisses out, your bladder empties before the glass is full."],
       ["A decent stream shoots from your cock into the glass. You grab yourself slightly to stop the flow as the glass fills",
         "A decent stream shoots from your cock into the glass, yet you fail to fill the whole glass."],
       ["The pee hisses out and the glass is filled in no time. You groan at the effort it takes to stop the flow, you can't grasp yourself as both your hand are occupied.",
         "The pee hisses out and the glass is filled in no time. You grab your dick as you force to flow to stop. It is hard but you manage with a groan."]]
   ],
   "wetyourself": [
     ["You are helpless as your bladder uncontrollably empties itself.",
      "Surely she can hear the hissing."
     ],
     ["You frantically look around, wanting to safe your car seat. You fumble with the seat belt, then wrench the door open and jump out of the car."
     ],
     [ "You stiffen and let out a shaky breath.",
       "You sigh and slump back in the tub, letting the relieve course through you.",
       "When you are finally empty you open your eyes to meet hers"
     ],
     [ "There is nothing you can do, your hands tighten on the steering wheel.",
       "<b>You:</b> Dammit!",
       "You are helpless as your bladder uncontrollably empties itself.",
       "Surely she can hear the hissing."
     ],
     ["<b>You:</b> I'm sorry about that. I really couldn't wait.",
       "You uncomfortably shift in the squishy wet seat."],
     ["<b>You:</b> I'm <u>so</u> sorry... I just couldn't hold it.",
      "The faint scent of your urine rises from the water.",
      "<b>You:</b> I peed in the tub."
      ]
   ],
   "spurtquote": "You manage to get your control back but you still let out a little bit.",
   "choices": [
     ["ypeeshot2", "Continue..."],
     ["ypeeshot3", "Continue..."],
     ["curloc", "Continue..."],
     ["ypeevase2", "Continue..."],
     ["ypeevase3", "Continue..."]
   ]
}