 {
  "burst": [
    "Your bladder feels like it's about to burst.",
    "You really can't hold on any more"],
  "desperate": [
   "You feel pretty desperate to pee now.",
    "You struggle to hold on to your bladder"
  ],
  "need": [
    "You feel like you could use a good pee, but nothing urgent.",
    "You're definitely aware of your bladder"
  ],
  "urge": [
    "You feel the barest sensation of a filling bladder",
    "You're starting to feel your bladder",
    "You're barely aware of your bladder"
  ],
  "empty": [
    "Your bladder feels fine.",
    "You don't feel any need to pee whatsoever"
  ],
   "ypeeshot": [
     "YOU: I got a shot glass. Here hold this for a minute.",
     "You give her the shot glass so you can open your fly with the hand that is not holding the steering wheel.",
     "You give her the shot glass so that you can use both hands to open your fly.",
     "You quickly whip your dick out, not really caring that she can see it.",
     "You urgently reach your hand to her.",
     "YOU: Give me the glass, it's coming out!",
     "girlname0",
     "You push it in place before allowing your muscles to relax.",
     "The pee hisses out and the glass is filled in no time. You groan at the effort it takes to stop the flow, you can't grasp yourself as both your hand are occupied.",
     "The pee hisses out and the glass is filled in no time. You grab your dick as you force to flow to stop. It is hard but you manage with a groan.",
     "YOU: Damn. That's not much better."
   ],
   "peevase": [
     "YOU: I got a vase. Here hold this for a minute.",
     "You give her the vase so you can open your fly with the hand that is not holding the steering wheel.",
     "You give her the vase so that you can use both hands to open your fly.",
     "You free your dick, in full view of her.",
     "girlname1",
     "<b>You<:/b> I can't hold it! Quick give me the vase!",
     "girlname2",
     "You quickly put it between your legs before releasing your bladder."
   ],
   "girlname": [
     "{0} quickly hands you the glass.",
     "You reach out to {0}.",
     "{0} gives you the vase."
   ],
   "choices": [
     ["ypeeshot2", "Continue..."],
     ["ypeeshot3", "Continue..."],
     ["curloc", "Continue..."],
     ["ypeevase2", "Continue..."],
     ["ypeevase3", "Continue..."]
   ]
}