{
  "yourhome": [
    "You head to your bathroom, not bothering to close the door.",
    "You stand in front of your toilet as you pull your dick out and start peeing, you urine splashes in the bowl."
  ],
  "thehome": [
    ["YOU: Can I use your toilet?",
    "girlname0",
    "girltalk0",
    "You head to her bathroom, leaving the door slightly ajar."],
    ["You quickly lift the toilet lid and seat before pulling yourself out and you start to pee loudly.You imagine her being in there with you watching you relieve yourself."]
  ],
  "remaining": [
    "You walk toward the restroom."
  ],
  "locked": {
    "bar": [
      "You try the door but it won't budge."
    ],
    "club": [
      "You arrive in the hallway to see a huge line of other men waiting for the toilet.",
      "There is no way you are going to wait for that!"
    ],
    "urgency": [
      "You groan in frustration, your hand sneaks downwards to your crotch giving it a quick message before heading back.",
      "You shift your weight uncomfortable before walking back with a sigh.",
      "girlname0"
    ],
    "cbar": [
      "YOU: It's <b><i>still</i></b> fucking locked!",
      "YOU: It's <b><i>still</i></b> locked!  What's taking so long?",
      "YOU: It's still locked!",
      "YOU: It was locked!"
    ],
    "cclub": [
      "YOU: The line's still really fucking long.",
      "YOU: I think the line's getting longer...",
      "YOU: The line's still really really long.",
      "YOU: There was a huge line."
    ],
    "girlname" : [
      "You sigh before walking back to {0}."
    ]
  },
  "thebar": [
    "YOU: It's <b><i>still</i></b> fucking locked!",
    "YOU: It's <b><i>still</i></b> locked!  What's taking so long?",
    "YOU: It's still locked!",
    "YOU: It was locked!"
  ],
  "youpeeprivate": [
    "You run up to the closest urinal, you panic as you feel it starting to come out but you quickly unzip and get the relieve you so desperately needed.",
    "You grab your crotch as you quickly make your way over to a urinal, you struggle to control it long enough to unzip, but you manage and find yourself enjoying the relieve of letting out all that pent up pee.",
    "You rush into the restroom and waste no time to walking over to a free urinal, you find yourself finally relaxing, pee shooting out of your penis for almost a full minute.",
    "You rush into the restroom, but to your dismay all urinals are occupied, you quickly dive into the stall, which thankfully is still empty, you're too desperate to even close the door before emptying your overfilled bladder.",
    "You practically dance in front of the urinal as you struggle to free yourself before your sphincter is finally allowed to relaxed and your full bladder empties into the urinal.",
    "You practically dive into the stall, in front of the toilet you struggle to control yourself long enough to pul your dick out of your boxers before emptying your overtaxed bladder into the toilet."
  ],
  "youpeeprivate2": [
    "You walk up to a urinal, slowly unzipping your trousers before using it.",
    "You walk up to a free urinal, pulling yourself out of your boxers before releasing your pent up pee.",
    "You wait until a urinal frees up before you relieve your filled bladder.",
    "The bathroom is empty, you briefly consider going into the sink but you are afraid of getting caught.",
    "You walk into the restroom, to find that all urinals are occupied, you instead choose to do your business in the empty stall.",
    "You kinda wish she had followed you into the bathroom, to see you empty your bladder into the toilet."
  ],
  "beg": [[
    "<b>YOU: </b> I really can't hold it any longer I got to go!",
    "girltalk1"],
    [["ypeeshot", "Pee in the shot glass"],
    ["ypeevase", "Pee in the vase."],
    ["curloc", "I have no ideas."]]],
  "girlname": [
    "{0} nods"
  ],
  "girltalk": [
    "{0} It's the third door on your right.",
    "{0} Do you have any ideas?"
  ],
  "peeTub": [
    "You relax your muscles while acting as if nothing is happening",
    "She doesn't seem to notice that you're peeing while sitting mere inches away from here.",
    "You can help but get a bit aroused as your bladder slowly empties."
  ],
  "peeOutside": [
    [ "<b>You:</b> Hang on I need a pee."],
    [ "<b>You:</b> Hold up I really need to pee!",
      "You are messaging your crotch to help you hold it."
    ],
    [ "girlname smiles shyly at you: \"Can I watch?\""],
    [ "You step out of the car and lower your zipper. Checking that no one is around you pull your penis out, exposing it to the world."],
    [ "Spreading your legs slightly, you unzip your jeans. When you are sure no one else is around you pull your cock out."],
    [ "You smile slightly at her before you step out of the car,",
      "Turning back towards her you give yourself a small stroke through your trousers, before moving your hands towards the fastenings",
      "You pop the button, before slowly lowering the zip. "
    ],
    [ "You push your underwear down a bit. Freeing your cock.",
      "She watches on. Mesmerized."
    ],
    [ "You smile slightly, giving her a small nod. Taking a step to the side before turning back to her.",
      "You watch her face as you gentle message your cock through your jeans.",
      "She is so focused on what your hands are doing that she doesn't notice you watching her.",
      "Feeling proud that you got her so distracted, you slowly pop the button on your trousers, opening your fly."
    ],
    [ "You subtly turn towards the car so she could watch if she wanted to before relaxing your bladder.",
      "The pee hisses out of your tip, and splatters on the ground, leaving a trail running under the car."
    ],
    [ "You only turn away from her slightly, allowing her to watch if she wants to, before relaxing your muscles."],
    [ "As you zip up, you can't help but feel yourself harden slightly at the idea that she might have been watching you."],
    [ "When you sure her eyes are focused on your cock, you relax your bladder.",
      "Warm yellow piss hisses through your foreskin, splattering onto the ground. Forming a puddle that reaches the car.",
      "Pushing out the last few drops, you shake your dick dry. Before giving it a few strokes, with her watching on.",
      "You let out small moan, before stuffing your half hard dick back into your trousers."
    ],
    [ "girltalk Wait, let me touch you!",
      "You hold back your water as she slowly approaches you, curious what she's planning.",
      "She stops at your side, before reaching out to cover the hand that is holding your cock.",
      "Gently battering your hand away, she grabs your dick a bit more firmly, pulling your foreskin back slightly.",
      "She leans into you before whispering in your ear.",
      "\"You can let go now.\"",
      "At this you relax your muscles."
    ],
    [ "When your finish she strokes you for a bit, making arousal flare low in your belly.",
      "Your cock hardens under her touch.",
      "That has to be one of the hottest things you have ever been a part of",
      "<i>You have to do that again!</i>"
    ]
  ],
  "theWalk": [
    [ "The pee hisses out from of your tip and runs in a stream along the ground."],
    [ "Piss hisses out of your slit, onto the ground.",
      "As you are peeing, she gently plays with our dick, spraying pee everywhere."
    ]
  ],
  "theBeach": [
    [ "The pee hisses out from of your tip, it soaks quickly into the sand turning it dark."],
    [ "Piss hisses from your slit, onto the sand.",
      "She gently moves your cock as you're peeing. Drawing a small heart in the sand with your pee."
    ]
  ]
}